#pragma once
#include "../PhiLoader.hpp"

#include "vulkan/vulkan.h"
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class VkInstanceLayoutLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 48) {}
    bool IS_LOAD_VK_VERSION_1_0 : 1;                         // 0
    bool IS_LOAD_VK_VERSION_1_1 : 1;                         // 1
    bool IS_LOAD_VK_VERSION_1_3 : 1;                         // 2
    bool IS_LOAD_VK_KHR_surface : 1;                         // 3
    bool IS_LOAD_VK_KHR_swapchain : 1;                       // 4
    bool IS_LOAD_VK_KHR_display : 1;                         // 5
    bool IS_LOAD_VK_KHR_video_queue : 1;                     // 6
    bool IS_LOAD_VK_KHR_get_physical_device_properties2 : 1; // 7
    bool IS_LOAD_VK_KHR_device_group_creation : 1;           // 8
    bool IS_LOAD_VK_KHR_external_memory_capabilities : 1;    // 9
    bool IS_LOAD_VK_KHR_external_semaphore_capabilities : 1; // 10
    bool IS_LOAD_VK_KHR_external_fence_capabilities : 1;     // 11
    bool IS_LOAD_VK_KHR_performance_query : 1;               // 12
    bool IS_LOAD_VK_KHR_get_surface_capabilities2 : 1;       // 13
    bool IS_LOAD_VK_KHR_get_display_properties2 : 1;         // 14
    bool IS_LOAD_VK_KHR_fragment_shading_rate : 1;           // 15
    bool IS_LOAD_VK_KHR_video_encode_queue : 1;              // 16
    bool IS_LOAD_VK_KHR_cooperative_matrix : 1;              // 17
    bool IS_LOAD_VK_KHR_calibrated_timestamps : 1;           // 18
    bool IS_LOAD_VK_EXT_debug_report : 1;                    // 19
    bool IS_LOAD_VK_NV_external_memory_capabilities : 1;     // 20
    bool IS_LOAD_VK_EXT_direct_mode_display : 1;             // 21
    bool IS_LOAD_VK_EXT_display_surface_counter : 1;         // 22
    bool IS_LOAD_VK_EXT_debug_utils : 1;                     // 23
    bool IS_LOAD_VK_EXT_sample_locations : 1;                // 24
    bool IS_LOAD_VK_EXT_calibrated_timestamps : 1;           // 25
    bool IS_LOAD_VK_EXT_tooling_info : 1;                    // 26
    bool IS_LOAD_VK_NV_cooperative_matrix : 1;               // 27
    bool IS_LOAD_VK_NV_coverage_reduction_mode : 1;          // 28
    bool IS_LOAD_VK_EXT_headless_surface : 1;                // 29
    bool IS_LOAD_VK_EXT_acquire_drm_display : 1;             // 30
    bool IS_LOAD_VK_NV_optical_flow : 1;                     // 31
    // NEED VK_USE_PLATFORM_ANDROID_KHR
    bool IS_LOAD_VK_KHR_android_surface : 1; // 32
    // NEED VK_USE_PLATFORM_FUCHSIA
    bool IS_LOAD_VK_FUCHSIA_imagepipe_surface : 1; // 33
    // NEED VK_USE_PLATFORM_GGP
    bool IS_LOAD_VK_GGP_stream_descriptor_surface : 1; // 34
    // NEED VK_USE_PLATFORM_IOS_MVK
    bool IS_LOAD_VK_MVK_ios_surface : 1; // 35
    // NEED VK_USE_PLATFORM_MACOS_MVK
    bool IS_LOAD_VK_MVK_macos_surface : 1; // 36
    // NEED VK_USE_PLATFORM_VI_NN
    bool IS_LOAD_VK_NN_vi_surface : 1; // 37
    // NEED VK_USE_PLATFORM_WAYLAND_KHR
    bool IS_LOAD_VK_KHR_wayland_surface : 1; // 38
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_KHR_win32_surface : 1; // 39
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_EXT_full_screen_exclusive : 1; // 40
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_NV_acquire_winrt_display : 1; // 41
    // NEED VK_USE_PLATFORM_XCB_KHR
    bool IS_LOAD_VK_KHR_xcb_surface : 1; // 42
    // NEED VK_USE_PLATFORM_XLIB_KHR
    bool IS_LOAD_VK_KHR_xlib_surface : 1; // 43
    // NEED VK_USE_PLATFORM_DIRECTFB_EXT
    bool IS_LOAD_VK_EXT_directfb_surface : 1; // 44
    // NEED VK_USE_PLATFORM_XLIB_XRANDR_EXT
    bool IS_LOAD_VK_EXT_acquire_xlib_display : 1; // 45
    // NEED VK_USE_PLATFORM_METAL_EXT
    bool IS_LOAD_VK_EXT_metal_surface : 1; // 46
    // NEED VK_USE_PLATFORM_SCREEN_QNX
    bool IS_LOAD_VK_QNX_screen_surface : 1; // 47
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  VkInstanceLayoutLoader();
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateInstance( const
  // VkInstanceCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator,
  // VkInstance* pInstance);
  VKFUNDEFINE(vkCreateInstance);
  // VKAPI_ATTR void VKAPI_CALL vkDestroyInstance( VkInstance instance, const
  // VkAllocationCallbacks* pAllocator);
  VKFUNDEFINE(vkDestroyInstance);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumeratePhysicalDevices( VkInstance
  // instance, uint32_t* pPhysicalDeviceCount, VkPhysicalDevice*
  // pPhysicalDevices);
  VKFUNDEFINE(vkEnumeratePhysicalDevices);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFeatures( VkPhysicalDevice
  // physicalDevice, VkPhysicalDeviceFeatures* pFeatures);
  VKFUNDEFINE(vkGetPhysicalDeviceFeatures);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFormatProperties(
  // VkPhysicalDevice physicalDevice, VkFormat format, VkFormatProperties*
  // pFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceFormatProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceImageFormatProperties(
  // VkPhysicalDevice physicalDevice, VkFormat format, VkImageType type,
  // VkImageTiling tiling, VkImageUsageFlags usage, VkImageCreateFlags flags,
  // VkImageFormatProperties* pImageFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceImageFormatProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceProperties( VkPhysicalDevice
  // physicalDevice, VkPhysicalDeviceProperties* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceQueueFamilyProperties(
  // VkPhysicalDevice physicalDevice, uint32_t* pQueueFamilyPropertyCount,
  // VkQueueFamilyProperties* pQueueFamilyProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceQueueFamilyProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceMemoryProperties(
  // VkPhysicalDevice physicalDevice, VkPhysicalDeviceMemoryProperties*
  // pMemoryProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceMemoryProperties);
  // VKAPI_ATTR PFN_vkVoidFunction VKAPI_CALL vkGetInstanceProcAddr( VkInstance
  // instance, const char* pName);
  VKFUNDEFINE(vkGetInstanceProcAddr);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDevice( VkPhysicalDevice
  // physicalDevice, const VkDeviceCreateInfo* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkDevice* pDevice);
  VKFUNDEFINE(vkCreateDevice);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumerateInstanceExtensionProperties(
  // const char* pLayerName, uint32_t* pPropertyCount, VkExtensionProperties*
  // pProperties);
  VKFUNDEFINE(vkEnumerateInstanceExtensionProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumerateDeviceExtensionProperties(
  // VkPhysicalDevice physicalDevice, const char* pLayerName, uint32_t*
  // pPropertyCount, VkExtensionProperties* pProperties);
  VKFUNDEFINE(vkEnumerateDeviceExtensionProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumerateInstanceLayerProperties(
  // uint32_t* pPropertyCount, VkLayerProperties* pProperties);
  VKFUNDEFINE(vkEnumerateInstanceLayerProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumerateDeviceLayerProperties(
  // VkPhysicalDevice physicalDevice, uint32_t* pPropertyCount,
  // VkLayerProperties* pProperties);
  VKFUNDEFINE(vkEnumerateDeviceLayerProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceSparseImageFormatProperties(
  // VkPhysicalDevice physicalDevice, VkFormat format, VkImageType type,
  // VkSampleCountFlagBits samples, VkImageUsageFlags usage, VkImageTiling
  // tiling, uint32_t* pPropertyCount, VkSparseImageFormatProperties*
  // pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceSparseImageFormatProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumerateInstanceVersion( uint32_t*
  // pApiVersion);
  VKFUNDEFINE(vkEnumerateInstanceVersion);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumeratePhysicalDeviceGroups( VkInstance
  // instance, uint32_t* pPhysicalDeviceGroupCount,
  // VkPhysicalDeviceGroupProperties* pPhysicalDeviceGroupProperties);
  VKFUNDEFINE(vkEnumeratePhysicalDeviceGroups);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFeatures2( VkPhysicalDevice
  // physicalDevice, VkPhysicalDeviceFeatures2* pFeatures);
  VKFUNDEFINE(vkGetPhysicalDeviceFeatures2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceProperties2( VkPhysicalDevice
  // physicalDevice, VkPhysicalDeviceProperties2* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceProperties2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFormatProperties2(
  // VkPhysicalDevice physicalDevice, VkFormat format, VkFormatProperties2*
  // pFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceFormatProperties2);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceImageFormatProperties2(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceImageFormatInfo2*
  // pImageFormatInfo, VkImageFormatProperties2* pImageFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceImageFormatProperties2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceQueueFamilyProperties2(
  // VkPhysicalDevice physicalDevice, uint32_t* pQueueFamilyPropertyCount,
  // VkQueueFamilyProperties2* pQueueFamilyProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceQueueFamilyProperties2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceMemoryProperties2(
  // VkPhysicalDevice physicalDevice, VkPhysicalDeviceMemoryProperties2*
  // pMemoryProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceMemoryProperties2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceSparseImageFormatProperties2(
  // VkPhysicalDevice physicalDevice, const
  // VkPhysicalDeviceSparseImageFormatInfo2* pFormatInfo, uint32_t*
  // pPropertyCount, VkSparseImageFormatProperties2* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceSparseImageFormatProperties2);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceExternalBufferProperties(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceExternalBufferInfo*
  // pExternalBufferInfo, VkExternalBufferProperties*
  // pExternalBufferProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalBufferProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceExternalFenceProperties(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceExternalFenceInfo*
  // pExternalFenceInfo, VkExternalFenceProperties* pExternalFenceProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalFenceProperties);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceExternalSemaphoreProperties(
  // VkPhysicalDevice physicalDevice, const
  // VkPhysicalDeviceExternalSemaphoreInfo* pExternalSemaphoreInfo,
  // VkExternalSemaphoreProperties* pExternalSemaphoreProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalSemaphoreProperties);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceToolProperties(
  // VkPhysicalDevice physicalDevice, uint32_t* pToolCount,
  // VkPhysicalDeviceToolProperties* pToolProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceToolProperties);
  // VKAPI_ATTR void VKAPI_CALL vkDestroySurfaceKHR( VkInstance instance,
  // VkSurfaceKHR surface, const VkAllocationCallbacks* pAllocator);
  VKFUNDEFINE(vkDestroySurfaceKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceSupportKHR(
  // VkPhysicalDevice physicalDevice, uint32_t queueFamilyIndex, VkSurfaceKHR
  // surface, VkBool32* pSupported);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceSupportKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceCapabilitiesKHR(
  // VkPhysicalDevice physicalDevice, VkSurfaceKHR surface,
  // VkSurfaceCapabilitiesKHR* pSurfaceCapabilities);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceCapabilitiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceFormatsKHR(
  // VkPhysicalDevice physicalDevice, VkSurfaceKHR surface, uint32_t*
  // pSurfaceFormatCount, VkSurfaceFormatKHR* pSurfaceFormats);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceFormatsKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfacePresentModesKHR(
  // VkPhysicalDevice physicalDevice, VkSurfaceKHR surface, uint32_t*
  // pPresentModeCount, VkPresentModeKHR* pPresentModes);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfacePresentModesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDevicePresentRectanglesKHR(
  // VkPhysicalDevice physicalDevice, VkSurfaceKHR surface, uint32_t*
  // pRectCount, VkRect2D* pRects);
  VKFUNDEFINE(vkGetPhysicalDevicePresentRectanglesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceDisplayPropertiesKHR(
  // VkPhysicalDevice physicalDevice, uint32_t* pPropertyCount,
  // VkDisplayPropertiesKHR* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceDisplayPropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceDisplayPlanePropertiesKHR( VkPhysicalDevice
  // physicalDevice, uint32_t* pPropertyCount, VkDisplayPlanePropertiesKHR*
  // pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceDisplayPlanePropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDisplayPlaneSupportedDisplaysKHR(
  // VkPhysicalDevice physicalDevice, uint32_t planeIndex, uint32_t*
  // pDisplayCount, VkDisplayKHR* pDisplays);
  VKFUNDEFINE(vkGetDisplayPlaneSupportedDisplaysKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDisplayModePropertiesKHR(
  // VkPhysicalDevice physicalDevice, VkDisplayKHR display, uint32_t*
  // pPropertyCount, VkDisplayModePropertiesKHR* pProperties);
  VKFUNDEFINE(vkGetDisplayModePropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDisplayModeKHR( VkPhysicalDevice
  // physicalDevice, VkDisplayKHR display, const VkDisplayModeCreateInfoKHR*
  // pCreateInfo, const VkAllocationCallbacks* pAllocator, VkDisplayModeKHR*
  // pMode);
  VKFUNDEFINE(vkCreateDisplayModeKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDisplayPlaneCapabilitiesKHR(
  // VkPhysicalDevice physicalDevice, VkDisplayModeKHR mode, uint32_t
  // planeIndex, VkDisplayPlaneCapabilitiesKHR* pCapabilities);
  VKFUNDEFINE(vkGetDisplayPlaneCapabilitiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDisplayPlaneSurfaceKHR( VkInstance
  // instance, const VkDisplaySurfaceCreateInfoKHR* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateDisplayPlaneSurfaceKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceVideoCapabilitiesKHR(
  // VkPhysicalDevice physicalDevice, const VkVideoProfileInfoKHR*
  // pVideoProfile, VkVideoCapabilitiesKHR* pCapabilities);
  VKFUNDEFINE(vkGetPhysicalDeviceVideoCapabilitiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceVideoFormatPropertiesKHR(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceVideoFormatInfoKHR*
  // pVideoFormatInfo, uint32_t* pVideoFormatPropertyCount,
  // VkVideoFormatPropertiesKHR* pVideoFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceVideoFormatPropertiesKHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFeatures2KHR(
  // VkPhysicalDevice physicalDevice, VkPhysicalDeviceFeatures2* pFeatures);
  VKFUNDEFINE(vkGetPhysicalDeviceFeatures2KHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceProperties2KHR(
  // VkPhysicalDevice physicalDevice, VkPhysicalDeviceProperties2* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceProperties2KHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceFormatProperties2KHR(
  // VkPhysicalDevice physicalDevice, VkFormat format, VkFormatProperties2*
  // pFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceFormatProperties2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceImageFormatProperties2KHR( VkPhysicalDevice
  // physicalDevice, const VkPhysicalDeviceImageFormatInfo2* pImageFormatInfo,
  // VkImageFormatProperties2* pImageFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceImageFormatProperties2KHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceQueueFamilyProperties2KHR(
  // VkPhysicalDevice physicalDevice, uint32_t* pQueueFamilyPropertyCount,
  // VkQueueFamilyProperties2* pQueueFamilyProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceQueueFamilyProperties2KHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceMemoryProperties2KHR(
  // VkPhysicalDevice physicalDevice, VkPhysicalDeviceMemoryProperties2*
  // pMemoryProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceMemoryProperties2KHR);
  // VKAPI_ATTR void VKAPI_CALL
  // vkGetPhysicalDeviceSparseImageFormatProperties2KHR( VkPhysicalDevice
  // physicalDevice, const VkPhysicalDeviceSparseImageFormatInfo2* pFormatInfo,
  // uint32_t* pPropertyCount, VkSparseImageFormatProperties2* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceSparseImageFormatProperties2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkEnumeratePhysicalDeviceGroupsKHR(
  // VkInstance instance, uint32_t* pPhysicalDeviceGroupCount,
  // VkPhysicalDeviceGroupProperties* pPhysicalDeviceGroupProperties);
  VKFUNDEFINE(vkEnumeratePhysicalDeviceGroupsKHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceExternalBufferPropertiesKHR(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceExternalBufferInfo*
  // pExternalBufferInfo, VkExternalBufferProperties*
  // pExternalBufferProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalBufferPropertiesKHR);
  // VKAPI_ATTR void VKAPI_CALL
  // vkGetPhysicalDeviceExternalSemaphorePropertiesKHR( VkPhysicalDevice
  // physicalDevice, const VkPhysicalDeviceExternalSemaphoreInfo*
  // pExternalSemaphoreInfo, VkExternalSemaphoreProperties*
  // pExternalSemaphoreProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalSemaphorePropertiesKHR);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceExternalFencePropertiesKHR(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceExternalFenceInfo*
  // pExternalFenceInfo, VkExternalFenceProperties* pExternalFenceProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalFencePropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkEnumeratePhysicalDeviceQueueFamilyPerformanceQueryCountersKHR(
  // VkPhysicalDevice physicalDevice, uint32_t queueFamilyIndex, uint32_t*
  // pCounterCount, VkPerformanceCounterKHR* pCounters,
  // VkPerformanceCounterDescriptionKHR* pCounterDescriptions);
  VKFUNDEFINE(vkEnumeratePhysicalDeviceQueueFamilyPerformanceQueryCountersKHR);
  // VKAPI_ATTR void VKAPI_CALL
  // vkGetPhysicalDeviceQueueFamilyPerformanceQueryPassesKHR( VkPhysicalDevice
  // physicalDevice, const VkQueryPoolPerformanceCreateInfoKHR*
  // pPerformanceQueryCreateInfo, uint32_t* pNumPasses);
  VKFUNDEFINE(vkGetPhysicalDeviceQueueFamilyPerformanceQueryPassesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceCapabilities2KHR(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceSurfaceInfo2KHR*
  // pSurfaceInfo, VkSurfaceCapabilities2KHR* pSurfaceCapabilities);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceCapabilities2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceFormats2KHR(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceSurfaceInfo2KHR*
  // pSurfaceInfo, uint32_t* pSurfaceFormatCount, VkSurfaceFormat2KHR*
  // pSurfaceFormats);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceFormats2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceDisplayProperties2KHR(
  // VkPhysicalDevice physicalDevice, uint32_t* pPropertyCount,
  // VkDisplayProperties2KHR* pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceDisplayProperties2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceDisplayPlaneProperties2KHR( VkPhysicalDevice
  // physicalDevice, uint32_t* pPropertyCount, VkDisplayPlaneProperties2KHR*
  // pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceDisplayPlaneProperties2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDisplayModeProperties2KHR(
  // VkPhysicalDevice physicalDevice, VkDisplayKHR display, uint32_t*
  // pPropertyCount, VkDisplayModeProperties2KHR* pProperties);
  VKFUNDEFINE(vkGetDisplayModeProperties2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDisplayPlaneCapabilities2KHR(
  // VkPhysicalDevice physicalDevice, const VkDisplayPlaneInfo2KHR*
  // pDisplayPlaneInfo, VkDisplayPlaneCapabilities2KHR* pCapabilities);
  VKFUNDEFINE(vkGetDisplayPlaneCapabilities2KHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceFragmentShadingRatesKHR(
  // VkPhysicalDevice physicalDevice, uint32_t* pFragmentShadingRateCount,
  // VkPhysicalDeviceFragmentShadingRateKHR* pFragmentShadingRates);
  VKFUNDEFINE(vkGetPhysicalDeviceFragmentShadingRatesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceVideoEncodeQualityLevelPropertiesKHR( VkPhysicalDevice
  // physicalDevice, const VkPhysicalDeviceVideoEncodeQualityLevelInfoKHR*
  // pQualityLevelInfo, VkVideoEncodeQualityLevelPropertiesKHR*
  // pQualityLevelProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceVideoEncodeQualityLevelPropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceCooperativeMatrixPropertiesKHR( VkPhysicalDevice
  // physicalDevice, uint32_t* pPropertyCount, VkCooperativeMatrixPropertiesKHR*
  // pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceCooperativeMatrixPropertiesKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceCalibrateableTimeDomainsKHR( VkPhysicalDevice
  // physicalDevice, uint32_t* pTimeDomainCount, VkTimeDomainKHR* pTimeDomains);
  VKFUNDEFINE(vkGetPhysicalDeviceCalibrateableTimeDomainsKHR);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDebugReportCallbackEXT( VkInstance
  // instance, const VkDebugReportCallbackCreateInfoEXT* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkDebugReportCallbackEXT* pCallback);
  VKFUNDEFINE(vkCreateDebugReportCallbackEXT);
  // VKAPI_ATTR void VKAPI_CALL vkDestroyDebugReportCallbackEXT( VkInstance
  // instance, VkDebugReportCallbackEXT callback, const VkAllocationCallbacks*
  // pAllocator);
  VKFUNDEFINE(vkDestroyDebugReportCallbackEXT);
  // VKAPI_ATTR void VKAPI_CALL vkDebugReportMessageEXT( VkInstance instance,
  // VkDebugReportFlagsEXT flags, VkDebugReportObjectTypeEXT objectType,
  // uint64_t object, size_t location, int32_t messageCode, const char*
  // pLayerPrefix, const char* pMessage);
  VKFUNDEFINE(vkDebugReportMessageEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceExternalImageFormatPropertiesNV( VkPhysicalDevice
  // physicalDevice, VkFormat format, VkImageType type, VkImageTiling tiling,
  // VkImageUsageFlags usage, VkImageCreateFlags flags,
  // VkExternalMemoryHandleTypeFlagsNV externalHandleType,
  // VkExternalImageFormatPropertiesNV* pExternalImageFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceExternalImageFormatPropertiesNV);
  // VKAPI_ATTR VkResult VKAPI_CALL vkReleaseDisplayEXT( VkPhysicalDevice
  // physicalDevice, VkDisplayKHR display);
  VKFUNDEFINE(vkReleaseDisplayEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfaceCapabilities2EXT(
  // VkPhysicalDevice physicalDevice, VkSurfaceKHR surface,
  // VkSurfaceCapabilities2EXT* pSurfaceCapabilities);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfaceCapabilities2EXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDebugUtilsMessengerEXT( VkInstance
  // instance, const VkDebugUtilsMessengerCreateInfoEXT* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkDebugUtilsMessengerEXT* pMessenger);
  VKFUNDEFINE(vkCreateDebugUtilsMessengerEXT);
  // VKAPI_ATTR void VKAPI_CALL vkDestroyDebugUtilsMessengerEXT( VkInstance
  // instance, VkDebugUtilsMessengerEXT messenger, const VkAllocationCallbacks*
  // pAllocator);
  VKFUNDEFINE(vkDestroyDebugUtilsMessengerEXT);
  // VKAPI_ATTR void VKAPI_CALL vkSubmitDebugUtilsMessageEXT( VkInstance
  // instance, VkDebugUtilsMessageSeverityFlagBitsEXT messageSeverity,
  // VkDebugUtilsMessageTypeFlagsEXT messageTypes, const
  // VkDebugUtilsMessengerCallbackDataEXT* pCallbackData);
  VKFUNDEFINE(vkSubmitDebugUtilsMessageEXT);
  // VKAPI_ATTR void VKAPI_CALL vkGetPhysicalDeviceMultisamplePropertiesEXT(
  // VkPhysicalDevice physicalDevice, VkSampleCountFlagBits samples,
  // VkMultisamplePropertiesEXT* pMultisampleProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceMultisamplePropertiesEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceCalibrateableTimeDomainsEXT( VkPhysicalDevice
  // physicalDevice, uint32_t* pTimeDomainCount, VkTimeDomainKHR* pTimeDomains);
  VKFUNDEFINE(vkGetPhysicalDeviceCalibrateableTimeDomainsEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceToolPropertiesEXT(
  // VkPhysicalDevice physicalDevice, uint32_t* pToolCount,
  // VkPhysicalDeviceToolProperties* pToolProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceToolPropertiesEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceCooperativeMatrixPropertiesNV( VkPhysicalDevice
  // physicalDevice, uint32_t* pPropertyCount, VkCooperativeMatrixPropertiesNV*
  // pProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceCooperativeMatrixPropertiesNV);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceSupportedFramebufferMixedSamplesCombinationsNV(
  // VkPhysicalDevice physicalDevice, uint32_t* pCombinationCount,
  // VkFramebufferMixedSamplesCombinationNV* pCombinations);
  VKFUNDEFINE(
      vkGetPhysicalDeviceSupportedFramebufferMixedSamplesCombinationsNV);
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateHeadlessSurfaceEXT( VkInstance
  // instance, const VkHeadlessSurfaceCreateInfoEXT* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateHeadlessSurfaceEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkAcquireDrmDisplayEXT( VkPhysicalDevice
  // physicalDevice, int32_t drmFd, VkDisplayKHR display);
  VKFUNDEFINE(vkAcquireDrmDisplayEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetDrmDisplayEXT( VkPhysicalDevice
  // physicalDevice, int32_t drmFd, uint32_t connectorId, VkDisplayKHR*
  // display);
  VKFUNDEFINE(vkGetDrmDisplayEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL
  // vkGetPhysicalDeviceOpticalFlowImageFormatsNV( VkPhysicalDevice
  // physicalDevice, const VkOpticalFlowImageFormatInfoNV*
  // pOpticalFlowImageFormatInfo, uint32_t* pFormatCount,
  // VkOpticalFlowImageFormatPropertiesNV* pImageFormatProperties);
  VKFUNDEFINE(vkGetPhysicalDeviceOpticalFlowImageFormatsNV);
#ifdef VK_USE_PLATFORM_ANDROID_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateAndroidSurfaceKHR( VkInstance
  // instance, const VkAndroidSurfaceCreateInfoKHR* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateAndroidSurfaceKHR);
#endif
#ifdef VK_USE_PLATFORM_FUCHSIA
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateImagePipeSurfaceFUCHSIA( VkInstance
  // instance, const VkImagePipeSurfaceCreateInfoFUCHSIA* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateImagePipeSurfaceFUCHSIA);
#endif
#ifdef VK_USE_PLATFORM_GGP
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateStreamDescriptorSurfaceGGP(
  // VkInstance instance, const VkStreamDescriptorSurfaceCreateInfoGGP*
  // pCreateInfo, const VkAllocationCallbacks* pAllocator, VkSurfaceKHR*
  // pSurface);
  VKFUNDEFINE(vkCreateStreamDescriptorSurfaceGGP);
#endif
#ifdef VK_USE_PLATFORM_IOS_MVK
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateIOSSurfaceMVK( VkInstance instance,
  // const VkIOSSurfaceCreateInfoMVK* pCreateInfo, const VkAllocationCallbacks*
  // pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateIOSSurfaceMVK);
#endif
#ifdef VK_USE_PLATFORM_MACOS_MVK
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateMacOSSurfaceMVK( VkInstance
  // instance, const VkMacOSSurfaceCreateInfoMVK* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateMacOSSurfaceMVK);
#endif
#ifdef VK_USE_PLATFORM_VI_NN
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateViSurfaceNN( VkInstance instance,
  // const VkViSurfaceCreateInfoNN* pCreateInfo, const VkAllocationCallbacks*
  // pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateViSurfaceNN);
#endif
#ifdef VK_USE_PLATFORM_WAYLAND_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateWaylandSurfaceKHR( VkInstance
  // instance, const VkWaylandSurfaceCreateInfoKHR* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateWaylandSurfaceKHR);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceWaylandPresentationSupportKHR( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex, struct wl_display* display);
  VKFUNDEFINE(vkGetPhysicalDeviceWaylandPresentationSupportKHR);
#endif
#ifdef VK_USE_PLATFORM_WIN32_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateWin32SurfaceKHR( VkInstance
  // instance, const VkWin32SurfaceCreateInfoKHR* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateWin32SurfaceKHR);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceWin32PresentationSupportKHR( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex);
  VKFUNDEFINE(vkGetPhysicalDeviceWin32PresentationSupportKHR);
#endif
#ifdef VK_USE_PLATFORM_WIN32_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetPhysicalDeviceSurfacePresentModes2EXT(
  // VkPhysicalDevice physicalDevice, const VkPhysicalDeviceSurfaceInfo2KHR*
  // pSurfaceInfo, uint32_t* pPresentModeCount, VkPresentModeKHR*
  // pPresentModes);
  VKFUNDEFINE(vkGetPhysicalDeviceSurfacePresentModes2EXT);
#endif
#ifdef VK_USE_PLATFORM_WIN32_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkAcquireWinrtDisplayNV( VkPhysicalDevice
  // physicalDevice, VkDisplayKHR display);
  VKFUNDEFINE(vkAcquireWinrtDisplayNV);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetWinrtDisplayNV( VkPhysicalDevice
  // physicalDevice, uint32_t deviceRelativeId, VkDisplayKHR* pDisplay);
  VKFUNDEFINE(vkGetWinrtDisplayNV);
#endif
#ifdef VK_USE_PLATFORM_XCB_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateXcbSurfaceKHR( VkInstance instance,
  // const VkXcbSurfaceCreateInfoKHR* pCreateInfo, const VkAllocationCallbacks*
  // pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateXcbSurfaceKHR);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceXcbPresentationSupportKHR( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex, xcb_connection_t* connection,
  // xcb_visualid_t visual_id);
  VKFUNDEFINE(vkGetPhysicalDeviceXcbPresentationSupportKHR);
#endif
#ifdef VK_USE_PLATFORM_XLIB_KHR
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateXlibSurfaceKHR( VkInstance instance,
  // const VkXlibSurfaceCreateInfoKHR* pCreateInfo, const VkAllocationCallbacks*
  // pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateXlibSurfaceKHR);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceXlibPresentationSupportKHR( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex, Display* dpy, VisualID
  // visualID);
  VKFUNDEFINE(vkGetPhysicalDeviceXlibPresentationSupportKHR);
#endif
#ifdef VK_USE_PLATFORM_DIRECTFB_EXT
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateDirectFBSurfaceEXT( VkInstance
  // instance, const VkDirectFBSurfaceCreateInfoEXT* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateDirectFBSurfaceEXT);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceDirectFBPresentationSupportEXT( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex, IDirectFB* dfb);
  VKFUNDEFINE(vkGetPhysicalDeviceDirectFBPresentationSupportEXT);
#endif
#ifdef VK_USE_PLATFORM_XLIB_XRANDR_EXT
  // VKAPI_ATTR VkResult VKAPI_CALL vkAcquireXlibDisplayEXT( VkPhysicalDevice
  // physicalDevice, Display* dpy, VkDisplayKHR display);
  VKFUNDEFINE(vkAcquireXlibDisplayEXT);
  // VKAPI_ATTR VkResult VKAPI_CALL vkGetRandROutputDisplayEXT( VkPhysicalDevice
  // physicalDevice, Display* dpy, RROutput rrOutput, VkDisplayKHR* pDisplay);
  VKFUNDEFINE(vkGetRandROutputDisplayEXT);
#endif
#ifdef VK_USE_PLATFORM_METAL_EXT
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateMetalSurfaceEXT( VkInstance
  // instance, const VkMetalSurfaceCreateInfoEXT* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateMetalSurfaceEXT);
#endif
#ifdef VK_USE_PLATFORM_SCREEN_QNX
  // VKAPI_ATTR VkResult VKAPI_CALL vkCreateScreenSurfaceQNX( VkInstance
  // instance, const VkScreenSurfaceCreateInfoQNX* pCreateInfo, const
  // VkAllocationCallbacks* pAllocator, VkSurfaceKHR* pSurface);
  VKFUNDEFINE(vkCreateScreenSurfaceQNX);
  // VKAPI_ATTR VkBool32 VKAPI_CALL
  // vkGetPhysicalDeviceScreenPresentationSupportQNX( VkPhysicalDevice
  // physicalDevice, uint32_t queueFamilyIndex, struct _screen_window* window);
  VKFUNDEFINE(vkGetPhysicalDeviceScreenPresentationSupportQNX);
#endif

  bool TRY_LOAD_VK_VERSION_1_0();                         // 0
  bool TRY_LOAD_VK_VERSION_1_1();                         // 1
  bool TRY_LOAD_VK_VERSION_1_3();                         // 2
  bool TRY_LOAD_VK_KHR_surface();                         // 3
  bool TRY_LOAD_VK_KHR_swapchain();                       // 4
  bool TRY_LOAD_VK_KHR_display();                         // 5
  bool TRY_LOAD_VK_KHR_video_queue();                     // 6
  bool TRY_LOAD_VK_KHR_get_physical_device_properties2(); // 7
  bool TRY_LOAD_VK_KHR_device_group_creation();           // 8
  bool TRY_LOAD_VK_KHR_external_memory_capabilities();    // 9
  bool TRY_LOAD_VK_KHR_external_semaphore_capabilities(); // 10
  bool TRY_LOAD_VK_KHR_external_fence_capabilities();     // 11
  bool TRY_LOAD_VK_KHR_performance_query();               // 12
  bool TRY_LOAD_VK_KHR_get_surface_capabilities2();       // 13
  bool TRY_LOAD_VK_KHR_get_display_properties2();         // 14
  bool TRY_LOAD_VK_KHR_fragment_shading_rate();           // 15
  bool TRY_LOAD_VK_KHR_video_encode_queue();              // 16
  bool TRY_LOAD_VK_KHR_cooperative_matrix();              // 17
  bool TRY_LOAD_VK_KHR_calibrated_timestamps();           // 18
  bool TRY_LOAD_VK_EXT_debug_report();                    // 19
  bool TRY_LOAD_VK_NV_external_memory_capabilities();     // 20
  bool TRY_LOAD_VK_EXT_direct_mode_display();             // 21
  bool TRY_LOAD_VK_EXT_display_surface_counter();         // 22
  bool TRY_LOAD_VK_EXT_debug_utils();                     // 23
  bool TRY_LOAD_VK_EXT_sample_locations();                // 24
  bool TRY_LOAD_VK_EXT_calibrated_timestamps();           // 25
  bool TRY_LOAD_VK_EXT_tooling_info();                    // 26
  bool TRY_LOAD_VK_NV_cooperative_matrix();               // 27
  bool TRY_LOAD_VK_NV_coverage_reduction_mode();          // 28
  bool TRY_LOAD_VK_EXT_headless_surface();                // 29
  bool TRY_LOAD_VK_EXT_acquire_drm_display();             // 30
  bool TRY_LOAD_VK_NV_optical_flow();                     // 31
  bool TRY_LOAD_VK_KHR_android_surface();                 // 32
  bool TRY_LOAD_VK_FUCHSIA_imagepipe_surface();           // 33
  bool TRY_LOAD_VK_GGP_stream_descriptor_surface();       // 34
  bool TRY_LOAD_VK_MVK_ios_surface();                     // 35
  bool TRY_LOAD_VK_MVK_macos_surface();                   // 36
  bool TRY_LOAD_VK_NN_vi_surface();                       // 37
  bool TRY_LOAD_VK_KHR_wayland_surface();                 // 38
  bool TRY_LOAD_VK_KHR_win32_surface();                   // 39
  bool TRY_LOAD_VK_EXT_full_screen_exclusive();           // 40
  bool TRY_LOAD_VK_NV_acquire_winrt_display();            // 41
  bool TRY_LOAD_VK_KHR_xcb_surface();                     // 42
  bool TRY_LOAD_VK_KHR_xlib_surface();                    // 43
  bool TRY_LOAD_VK_EXT_directfb_surface();                // 44
  bool TRY_LOAD_VK_EXT_acquire_xlib_display();            // 45
  bool TRY_LOAD_VK_EXT_metal_surface();                   // 46
  bool TRY_LOAD_VK_QNX_screen_surface();                  // 47

  typedef bool (VkInstanceLayoutLoader::*EXTLOADER)();
  using MAP = ExtendsMap<std::string, EXTLOADER, size_t>;
  static std::vector<EXTLOADER> TRAN2FUN(const std::vector<std::string> &list);
  static std::vector<size_t> TRAN(const std::vector<std::string> &list);

  bool MappingToNeedLoad(const std::vector<size_t> &list);
  static std::vector<EXTLOADER>
  TRAN2FUN(const std::vector<std::string> &&list) {
    return TRAN2FUN(list);
  }
  static std::vector<size_t> TRAN(std::vector<std::string> &&list) {
    return TRAN(list);
  }
  inline bool MappingToNeedLoad(const std::vector<std::string> &list) {
    auto encd = TRAN(list);
    return MappingToNeedLoad(encd);
  }
  inline bool MappingToNeedLoad(std::vector<std::string> &&list) {
    return MappingToNeedLoad(list);
  }

  Flags LoadAll();
};
class VkDeviceLayoutLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 117) {}
    bool IS_LOAD_VK_VERSION_1_0 : 1;                                // 0
    bool IS_LOAD_VK_VERSION_1_1 : 1;                                // 1
    bool IS_LOAD_VK_VERSION_1_2 : 1;                                // 2
    bool IS_LOAD_VK_VERSION_1_3 : 1;                                // 3
    bool IS_LOAD_VK_KHR_swapchain : 1;                              // 4
    bool IS_LOAD_VK_KHR_display_swapchain : 1;                      // 5
    bool IS_LOAD_VK_KHR_video_queue : 1;                            // 6
    bool IS_LOAD_VK_KHR_video_decode_queue : 1;                     // 7
    bool IS_LOAD_VK_KHR_dynamic_rendering : 1;                      // 8
    bool IS_LOAD_VK_KHR_device_group : 1;                           // 9
    bool IS_LOAD_VK_KHR_maintenance1 : 1;                           // 10
    bool IS_LOAD_VK_KHR_external_memory_fd : 1;                     // 11
    bool IS_LOAD_VK_KHR_external_semaphore_fd : 1;                  // 12
    bool IS_LOAD_VK_KHR_push_descriptor : 1;                        // 13
    bool IS_LOAD_VK_KHR_descriptor_update_template : 1;             // 14
    bool IS_LOAD_VK_KHR_create_renderpass2 : 1;                     // 15
    bool IS_LOAD_VK_KHR_shared_presentable_image : 1;               // 16
    bool IS_LOAD_VK_KHR_external_fence_fd : 1;                      // 17
    bool IS_LOAD_VK_KHR_performance_query : 1;                      // 18
    bool IS_LOAD_VK_KHR_get_memory_requirements2 : 1;               // 19
    bool IS_LOAD_VK_KHR_sampler_ycbcr_conversion : 1;               // 20
    bool IS_LOAD_VK_KHR_bind_memory2 : 1;                           // 21
    bool IS_LOAD_VK_KHR_maintenance3 : 1;                           // 22
    bool IS_LOAD_VK_KHR_draw_indirect_count : 1;                    // 23
    bool IS_LOAD_VK_KHR_timeline_semaphore : 1;                     // 24
    bool IS_LOAD_VK_KHR_fragment_shading_rate : 1;                  // 25
    bool IS_LOAD_VK_KHR_dynamic_rendering_local_read : 1;           // 26
    bool IS_LOAD_VK_KHR_present_wait : 1;                           // 27
    bool IS_LOAD_VK_KHR_buffer_device_address : 1;                  // 28
    bool IS_LOAD_VK_KHR_deferred_host_operations : 1;               // 29
    bool IS_LOAD_VK_KHR_pipeline_executable_properties : 1;         // 30
    bool IS_LOAD_VK_KHR_map_memory2 : 1;                            // 31
    bool IS_LOAD_VK_KHR_video_encode_queue : 1;                     // 32
    bool IS_LOAD_VK_KHR_synchronization2 : 1;                       // 33
    bool IS_LOAD_VK_KHR_copy_commands2 : 1;                         // 34
    bool IS_LOAD_VK_KHR_ray_tracing_maintenance1 : 1;               // 35
    bool IS_LOAD_VK_KHR_maintenance4 : 1;                           // 36
    bool IS_LOAD_VK_KHR_maintenance5 : 1;                           // 37
    bool IS_LOAD_VK_KHR_line_rasterization : 1;                     // 38
    bool IS_LOAD_VK_KHR_calibrated_timestamps : 1;                  // 39
    bool IS_LOAD_VK_KHR_maintenance6 : 1;                           // 40
    bool IS_LOAD_VK_EXT_debug_marker : 1;                           // 41
    bool IS_LOAD_VK_EXT_transform_feedback : 1;                     // 42
    bool IS_LOAD_VK_NVX_binary_import : 1;                          // 43
    bool IS_LOAD_VK_NVX_image_view_handle : 1;                      // 44
    bool IS_LOAD_VK_AMD_draw_indirect_count : 1;                    // 45
    bool IS_LOAD_VK_AMD_shader_info : 1;                            // 46
    bool IS_LOAD_VK_EXT_conditional_rendering : 1;                  // 47
    bool IS_LOAD_VK_NV_clip_space_w_scaling : 1;                    // 48
    bool IS_LOAD_VK_EXT_display_control : 1;                        // 49
    bool IS_LOAD_VK_GOOGLE_display_timing : 1;                      // 50
    bool IS_LOAD_VK_EXT_discard_rectangles : 1;                     // 51
    bool IS_LOAD_VK_EXT_hdr_metadata : 1;                           // 52
    bool IS_LOAD_VK_EXT_debug_utils : 1;                            // 53
    bool IS_LOAD_VK_EXT_sample_locations : 1;                       // 54
    bool IS_LOAD_VK_EXT_image_drm_format_modifier : 1;              // 55
    bool IS_LOAD_VK_EXT_validation_cache : 1;                       // 56
    bool IS_LOAD_VK_NV_shading_rate_image : 1;                      // 57
    bool IS_LOAD_VK_NV_ray_tracing : 1;                             // 58
    bool IS_LOAD_VK_EXT_external_memory_host : 1;                   // 59
    bool IS_LOAD_VK_AMD_buffer_marker : 1;                          // 60
    bool IS_LOAD_VK_EXT_calibrated_timestamps : 1;                  // 61
    bool IS_LOAD_VK_NV_mesh_shader : 1;                             // 62
    bool IS_LOAD_VK_NV_scissor_exclusive : 1;                       // 63
    bool IS_LOAD_VK_NV_device_diagnostic_checkpoints : 1;           // 64
    bool IS_LOAD_VK_INTEL_performance_query : 1;                    // 65
    bool IS_LOAD_VK_AMD_display_native_hdr : 1;                     // 66
    bool IS_LOAD_VK_EXT_buffer_device_address : 1;                  // 67
    bool IS_LOAD_VK_EXT_line_rasterization : 1;                     // 68
    bool IS_LOAD_VK_EXT_host_query_reset : 1;                       // 69
    bool IS_LOAD_VK_EXT_extended_dynamic_state : 1;                 // 70
    bool IS_LOAD_VK_EXT_host_image_copy : 1;                        // 71
    bool IS_LOAD_VK_EXT_swapchain_maintenance1 : 1;                 // 72
    bool IS_LOAD_VK_NV_device_generated_commands : 1;               // 73
    bool IS_LOAD_VK_EXT_depth_bias_control : 1;                     // 74
    bool IS_LOAD_VK_EXT_private_data : 1;                           // 75
    bool IS_LOAD_VK_NV_cuda_kernel_launch : 1;                      // 76
    bool IS_LOAD_VK_EXT_descriptor_buffer : 1;                      // 77
    bool IS_LOAD_VK_NV_fragment_shading_rate_enums : 1;             // 78
    bool IS_LOAD_VK_EXT_device_fault : 1;                           // 79
    bool IS_LOAD_VK_EXT_vertex_input_dynamic_state : 1;             // 80
    bool IS_LOAD_VK_HUAWEI_subpass_shading : 1;                     // 81
    bool IS_LOAD_VK_HUAWEI_invocation_mask : 1;                     // 82
    bool IS_LOAD_VK_NV_external_memory_rdma : 1;                    // 83
    bool IS_LOAD_VK_EXT_pipeline_properties : 1;                    // 84
    bool IS_LOAD_VK_EXT_extended_dynamic_state2 : 1;                // 85
    bool IS_LOAD_VK_EXT_color_write_enable : 1;                     // 86
    bool IS_LOAD_VK_EXT_multi_draw : 1;                             // 87
    bool IS_LOAD_VK_EXT_opacity_micromap : 1;                       // 88
    bool IS_LOAD_VK_HUAWEI_cluster_culling_shader : 1;              // 89
    bool IS_LOAD_VK_EXT_pageable_device_local_memory : 1;           // 90
    bool IS_LOAD_VK_VALVE_descriptor_set_host_mapping : 1;          // 91
    bool IS_LOAD_VK_NV_copy_memory_indirect : 1;                    // 92
    bool IS_LOAD_VK_NV_memory_decompression : 1;                    // 93
    bool IS_LOAD_VK_NV_device_generated_commands_compute : 1;       // 94
    bool IS_LOAD_VK_EXT_extended_dynamic_state3 : 1;                // 95
    bool IS_LOAD_VK_EXT_shader_module_identifier : 1;               // 96
    bool IS_LOAD_VK_NV_optical_flow : 1;                            // 97
    bool IS_LOAD_VK_EXT_shader_object : 1;                          // 98
    bool IS_LOAD_VK_QCOM_tile_properties : 1;                       // 99
    bool IS_LOAD_VK_NV_low_latency2 : 1;                            // 100
    bool IS_LOAD_VK_EXT_attachment_feedback_loop_dynamic_state : 1; // 101
    bool IS_LOAD_VK_KHR_acceleration_structure : 1;                 // 102
    bool IS_LOAD_VK_KHR_ray_tracing_pipeline : 1;                   // 103
    bool IS_LOAD_VK_EXT_mesh_shader : 1;                            // 104
    // NEED VK_USE_PLATFORM_ANDROID_KHR
    bool IS_LOAD_VK_ANDROID_external_memory_android_hardware_buffer : 1; // 105
    // NEED VK_USE_PLATFORM_FUCHSIA
    bool IS_LOAD_VK_FUCHSIA_external_memory : 1; // 106
    // NEED VK_USE_PLATFORM_FUCHSIA
    bool IS_LOAD_VK_FUCHSIA_external_semaphore : 1; // 107
    // NEED VK_USE_PLATFORM_FUCHSIA
    bool IS_LOAD_VK_FUCHSIA_buffer_collection : 1; // 108
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_KHR_external_memory_win32 : 1; // 109
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_KHR_external_semaphore_win32 : 1; // 110
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_KHR_external_fence_win32 : 1; // 111
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_NV_external_memory_win32 : 1; // 112
    // NEED VK_USE_PLATFORM_WIN32_KHR
    bool IS_LOAD_VK_EXT_full_screen_exclusive : 1; // 113
    // NEED VK_USE_PLATFORM_METAL_EXT
    bool IS_LOAD_VK_EXT_metal_objects : 1; // 114
    // NEED VK_USE_PLATFORM_SCREEN_QNX
    bool IS_LOAD_VK_QNX_external_memory_screen_buffer : 1; // 115
    // NEED VK_ENABLE_BETA_EXTENSIONS
    bool IS_LOAD_VK_AMDX_shader_enqueue : 1; // 116
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  VkDeviceLayoutLoader();
  // VKAPI_ATTR PFN_vkVoidFunction VKAPI_CALL vkGetDeviceProcAddr( VkDevice
  // device, const char* pName);
  VKFUNDEFINE(vkGetDeviceProcAddr);
  // VKAPI_ATTR void VKAPI_CALL vkDestroyDevice( VkDevice device, const
  // VkAllocationCallbacks* pAllocator);
  VKFUNDEFINE(vkDestroyDevice);
  // VKAPI_ATTR void VKAPI_CALL vkGetDeviceQueue( VkDevice device, uint32_t
  // queueFamilyIndex, uint32_t queueIndex, VkQueue* pQueue);
  VKFUNDEFINE(vkGetDeviceQueue);
  // VKAPI_ATTR VkResult VKAPI_CALL vkQueueSubmit( VkQueue queue, uint32_t
  // submitCount, const VkSubmitInfo* pSubmits, VkFence fence);
  VKFUNDEFINE(vkQueueSubmit);
