#pragma once
#include "../PhiLoader.hpp"
#include <EGL/egl.h>
#include <EGL/eglext.h>
typedef PFNEGLCHOOSECONFIGPROC PFN_eglChooseConfig;
typedef PFNEGLCOPYBUFFERSPROC PFN_eglCopyBuffers;
typedef PFNEGLCREATECONTEXTPROC PFN_eglCreateContext;
typedef PFNEGLCREATEPBUFFERSURFACEPROC PFN_eglCreatePbufferSurface;
typedef PFNEGLCREATEPIXMAPSURFACEPROC PFN_eglCreatePixmapSurface;
typedef PFNEGLCREATEWINDOWSURFACEPROC PFN_eglCreateWindowSurface;
typedef PFNEGLDESTROYCONTEXTPROC PFN_eglDestroyContext;
typedef PFNEGLDESTROYSURFACEPROC PFN_eglDestroySurface;
typedef PFNEGLGETCONFIGATTRIBPROC PFN_eglGetConfigAttrib;
typedef PFNEGLGETCONFIGSPROC PFN_eglGetConfigs;
typedef PFNEGLGETCURRENTDISPLAYPROC PFN_eglGetCurrentDisplay;
typedef PFNEGLGETCURRENTSURFACEPROC PFN_eglGetCurrentSurface;
typedef PFNEGLGETDISPLAYPROC PFN_eglGetDisplay;
typedef PFNEGLGETERRORPROC PFN_eglGetError;
typedef PFNEGLGETPROCADDRESSPROC PFN_eglGetProcAddress;
typedef PFNEGLINITIALIZEPROC PFN_eglInitialize;
typedef PFNEGLMAKECURRENTPROC PFN_eglMakeCurrent;
typedef PFNEGLQUERYCONTEXTPROC PFN_eglQueryContext;
typedef PFNEGLQUERYSTRINGPROC PFN_eglQueryString;
typedef PFNEGLQUERYSURFACEPROC PFN_eglQuerySurface;
typedef PFNEGLSWAPBUFFERSPROC PFN_eglSwapBuffers;
typedef PFNEGLTERMINATEPROC PFN_eglTerminate;
typedef PFNEGLWAITGLPROC PFN_eglWaitGL;
typedef PFNEGLWAITNATIVEPROC PFN_eglWaitNative;
typedef PFNEGLBINDTEXIMAGEPROC PFN_eglBindTexImage;
typedef PFNEGLRELEASETEXIMAGEPROC PFN_eglReleaseTexImage;

typedef PFNEGLGETPLATFORMDISPLAYEXTPROC PFN_eglGetPlatformDisplayEXT;
typedef PFNEGLCREATEPLATFORMWINDOWSURFACEEXTPROC
    PFN_eglCreatePlatformWindowSurfaceEXT;
typedef PFNEGLCREATEPLATFORMPIXMAPSURFACEEXTPROC
    PFN_eglCreatePlatformPixmapSurfaceEXT;
typedef PFNEGLSTREAMCONSUMEROUTPUTEXTPROC PFN_eglStreamConsumerOutputEXT;
typedef PFNEGLQUERYSUPPORTEDCOMPRESSIONRATESEXTPROC
    PFN_eglQuerySupportedCompressionRatesEXT;
typedef PFNEGLSWAPBUFFERSWITHDAMAGEEXTPROC PFN_eglSwapBuffersWithDamageEXT;
typedef PFNEGLUNSIGNALSYNCEXTPROC PFN_eglUnsignalSyncEXT;
typedef PFNEGLCREATEPIXMAPSURFACEHIPROC PFN_eglCreatePixmapSurfaceHI;
typedef PFNEGLCREATEDRMIMAGEMESAPROC PFN_eglCreateDRMImageMESA;
typedef PFNEGLEXPORTDRMIMAGEMESAPROC PFN_eglExportDRMImageMESA;
typedef PFNEGLEXPORTDMABUFIMAGEQUERYMESAPROC PFN_eglExportDMABUFImageQueryMESA;
typedef PFNEGLEXPORTDMABUFIMAGEMESAPROC PFN_eglExportDMABUFImageMESA;
typedef PFNEGLGETDISPLAYDRIVERCONFIGPROC PFN_eglGetDisplayDriverConfig;
typedef PFNEGLGETDISPLAYDRIVERNAMEPROC PFN_eglGetDisplayDriverName;
typedef PFNEGLSWAPBUFFERSREGIONNOKPROC PFN_eglSwapBuffersRegionNOK;
typedef PFNEGLSWAPBUFFERSREGION2NOKPROC PFN_eglSwapBuffersRegion2NOK;
typedef PFNEGLQUERYNATIVEDISPLAYNVPROC PFN_eglQueryNativeDisplayNV;
typedef PFNEGLQUERYNATIVEWINDOWNVPROC PFN_eglQueryNativeWindowNV;
typedef PFNEGLQUERYNATIVEPIXMAPNVPROC PFN_eglQueryNativePixmapNV;
typedef PFNEGLPOSTSUBBUFFERNVPROC PFN_eglPostSubBufferNV;
typedef PFNEGLSTREAMIMAGECONSUMERCONNECTNVPROC
    PFN_eglStreamImageConsumerConnectNV;
typedef PFNEGLQUERYSTREAMCONSUMEREVENTNVPROC PFN_eglQueryStreamConsumerEventNV;
typedef PFNEGLSTREAMACQUIREIMAGENVPROC PFN_eglStreamAcquireImageNV;
typedef PFNEGLSTREAMRELEASEIMAGENVPROC PFN_eglStreamReleaseImageNV;
typedef PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALATTRIBSNVPROC
    PFN_eglStreamConsumerGLTextureExternalAttribsNV;
typedef PFNEGLSTREAMFLUSHNVPROC PFN_eglStreamFlushNV;
typedef PFNEGLQUERYDISPLAYATTRIBNVPROC PFN_eglQueryDisplayAttribNV;
typedef PFNEGLSETSTREAMMETADATANVPROC PFN_eglSetStreamMetadataNV;
typedef PFNEGLQUERYSTREAMMETADATANVPROC PFN_eglQueryStreamMetadataNV;
typedef PFNEGLRESETSTREAMNVPROC PFN_eglResetStreamNV;
typedef PFNEGLCREATESTREAMSYNCNVPROC PFN_eglCreateStreamSyncNV;
typedef PFNEGLCREATEFENCESYNCNVPROC PFN_eglCreateFenceSyncNV;
typedef PFNEGLDESTROYSYNCNVPROC PFN_eglDestroySyncNV;
typedef PFNEGLFENCENVPROC PFN_eglFenceNV;
typedef PFNEGLCLIENTWAITSYNCNVPROC PFN_eglClientWaitSyncNV;
typedef PFNEGLSIGNALSYNCNVPROC PFN_eglSignalSyncNV;
typedef PFNEGLGETSYNCATTRIBNVPROC PFN_eglGetSyncAttribNV;
typedef PFNEGLGETSYSTEMTIMEFREQUENCYNVPROC PFN_eglGetSystemTimeFrequencyNV;
typedef PFNEGLGETSYSTEMTIMENVPROC PFN_eglGetSystemTimeNV;
typedef PFNEGLBINDWAYLANDDISPLAYWLPROC PFN_eglBindWaylandDisplayWL;
typedef PFNEGLUNBINDWAYLANDDISPLAYWLPROC PFN_eglUnbindWaylandDisplayWL;
typedef PFNEGLQUERYWAYLANDBUFFERWLPROC PFN_eglQueryWaylandBufferWL;
typedef PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWLPROC
    PFN_eglCreateWaylandBufferFromImageWL;
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class EGLLoaderLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 59) {}
    bool IS_LOAD_EGL_VERSION_1_0 : 1;                         // 0
    bool IS_LOAD_EGL_VERSION_1_1 : 1;                         // 1
    bool IS_LOAD_EGL_VERSION_1_2 : 1;                         // 2
    bool IS_LOAD_EGL_VERSION_1_4 : 1;                         // 3
    bool IS_LOAD_EGL_VERSION_1_5 : 1;                         // 4
    bool IS_LOAD_EGL_KHR_cl_event2 : 1;                       // 5
    bool IS_LOAD_EGL_KHR_debug : 1;                           // 6
    bool IS_LOAD_EGL_KHR_display_reference : 1;               // 7
    bool IS_LOAD_EGL_KHR_fence_sync : 1;                      // 8
    bool IS_LOAD_EGL_KHR_image : 1;                           // 9
    bool IS_LOAD_EGL_KHR_lock_surface : 1;                    // 10
    bool IS_LOAD_EGL_KHR_lock_surface3 : 1;                   // 11
    bool IS_LOAD_EGL_KHR_partial_update : 1;                  // 12
    bool IS_LOAD_EGL_KHR_reusable_sync : 1;                   // 13
    bool IS_LOAD_EGL_KHR_stream : 1;                          // 14
    bool IS_LOAD_EGL_KHR_stream_attrib : 1;                   // 15
    bool IS_LOAD_EGL_KHR_stream_consumer_gltexture : 1;       // 16
    bool IS_LOAD_EGL_KHR_stream_cross_process_fd : 1;         // 17
    bool IS_LOAD_EGL_KHR_stream_fifo : 1;                     // 18
    bool IS_LOAD_EGL_KHR_stream_producer_eglsurface : 1;      // 19
    bool IS_LOAD_EGL_KHR_swap_buffers_with_damage : 1;        // 20
    bool IS_LOAD_EGL_KHR_wait_sync : 1;                       // 21
    bool IS_LOAD_EGL_ANDROID_blob_cache : 1;                  // 22
    bool IS_LOAD_EGL_ANDROID_create_native_client_buffer : 1; // 23
    bool IS_LOAD_EGL_ANDROID_get_frame_timestamps : 1;        // 24
    bool IS_LOAD_EGL_ANDROID_get_native_client_buffer : 1;    // 25
    bool IS_LOAD_EGL_ANDROID_native_fence_sync : 1;           // 26
    bool IS_LOAD_EGL_ANDROID_presentation_time : 1;           // 27
    bool IS_LOAD_EGL_ANGLE_query_surface_pointer : 1;         // 28
    bool IS_LOAD_EGL_ANGLE_sync_control_rate : 1;             // 29
    bool IS_LOAD_EGL_EXT_client_sync : 1;                     // 30
    bool IS_LOAD_EGL_EXT_compositor : 1;                      // 31
    bool IS_LOAD_EGL_EXT_device_base : 1;                     // 32
    bool IS_LOAD_EGL_EXT_device_persistent_id : 1;            // 33
    bool IS_LOAD_EGL_EXT_image_dma_buf_import_modifiers : 1;  // 34
    bool IS_LOAD_EGL_EXT_output_base : 1;                     // 35
    bool IS_LOAD_EGL_EXT_platform_base : 1;                   // 36
    bool IS_LOAD_EGL_EXT_stream_consumer_egloutput : 1;       // 37
    bool IS_LOAD_EGL_EXT_surface_compression : 1;             // 38
    bool IS_LOAD_EGL_EXT_swap_buffers_with_damage : 1;        // 39
    bool IS_LOAD_EGL_EXT_sync_reuse : 1;                      // 40
    bool IS_LOAD_EGL_HI_clientpixmap : 1;                     // 41
    bool IS_LOAD_EGL_MESA_drm_image : 1;                      // 42
    bool IS_LOAD_EGL_MESA_image_dma_buf_export : 1;           // 43
    bool IS_LOAD_EGL_MESA_query_driver : 1;                   // 44
    bool IS_LOAD_EGL_NOK_swap_region : 1;                     // 45
    bool IS_LOAD_EGL_NOK_swap_region2 : 1;                    // 46
    bool IS_LOAD_EGL_NV_native_query : 1;                     // 47
    bool IS_LOAD_EGL_NV_post_sub_buffer : 1;                  // 48
    bool IS_LOAD_EGL_NV_stream_consumer_eglimage : 1;         // 49
    bool IS_LOAD_EGL_NV_stream_consumer_gltexture_yuv : 1;    // 50
    bool IS_LOAD_EGL_NV_stream_flush : 1;                     // 51
    bool IS_LOAD_EGL_NV_stream_metadata : 1;                  // 52
    bool IS_LOAD_EGL_NV_stream_reset : 1;                     // 53
    bool IS_LOAD_EGL_NV_stream_sync : 1;                      // 54
    bool IS_LOAD_EGL_NV_sync : 1;                             // 55
    bool IS_LOAD_EGL_NV_system_time : 1;                      // 56
    bool IS_LOAD_EGL_WL_bind_wayland_display : 1;             // 57
    bool IS_LOAD_EGL_WL_create_wayland_buffer_from_image : 1; // 58
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  EGLLoaderLoader();
  // EGLAPI EGLBoolean EGLAPIENTRY eglChooseConfig (EGLDisplay dpy, const EGLint
  // *attrib_list, EGLConfig *configs, EGLint config_size, EGLint *num_config);
  VKFUNDEFINE(eglChooseConfig);
  // EGLAPI EGLBoolean EGLAPIENTRY eglCopyBuffers (EGLDisplay dpy, EGLSurface
  // surface, EGLNativePixmapType target);
  VKFUNDEFINE(eglCopyBuffers);
  // EGLAPI EGLContext EGLAPIENTRY eglCreateContext (EGLDisplay dpy, EGLConfig
  // config, EGLContext share_context, const EGLint *attrib_list);
  VKFUNDEFINE(eglCreateContext);
  // EGLAPI EGLSurface EGLAPIENTRY eglCreatePbufferSurface (EGLDisplay dpy,
  // EGLConfig config, const EGLint *attrib_list);
