#pragma once
#include "../PhiLoader.hpp"
#include <GLES2/gl2.h>
#include <GLES2/gl2ext.h>
typedef PFNGLACTIVETEXTUREPROC PFN_glActiveTexture;
typedef PFNGLATTACHSHADERPROC PFN_glAttachShader;
typedef PFNGLBINDATTRIBLOCATIONPROC PFN_glBindAttribLocation;
typedef PFNGLBINDBUFFERPROC PFN_glBindBuffer;
typedef PFNGLBINDFRAMEBUFFERPROC PFN_glBindFramebuffer;
typedef PFNGLBINDRENDERBUFFERPROC PFN_glBindRenderbuffer;
typedef PFNGLBINDTEXTUREPROC PFN_glBindTexture;
typedef PFNGLBLENDCOLORPROC PFN_glBlendColor;
typedef PFNGLBLENDEQUATIONPROC PFN_glBlendEquation;
typedef PFNGLBLENDEQUATIONSEPARATEPROC PFN_glBlendEquationSeparate;
typedef PFNGLBLENDFUNCPROC PFN_glBlendFunc;
typedef PFNGLBLENDFUNCSEPARATEPROC PFN_glBlendFuncSeparate;
typedef PFNGLBUFFERDATAPROC PFN_glBufferData;
typedef PFNGLBUFFERSUBDATAPROC PFN_glBufferSubData;
typedef PFNGLCHECKFRAMEBUFFERSTATUSPROC PFN_glCheckFramebufferStatus;
typedef PFNGLCLEARPROC PFN_glClear;
typedef PFNGLCLEARCOLORPROC PFN_glClearColor;
typedef PFNGLCLEARDEPTHFPROC PFN_glClearDepthf;
typedef PFNGLCLEARSTENCILPROC PFN_glClearStencil;
typedef PFNGLCOLORMASKPROC PFN_glColorMask;
typedef PFNGLCOMPILESHADERPROC PFN_glCompileShader;
typedef PFNGLCOMPRESSEDTEXIMAGE2DPROC PFN_glCompressedTexImage2D;
typedef PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC PFN_glCompressedTexSubImage2D;
typedef PFNGLCOPYTEXIMAGE2DPROC PFN_glCopyTexImage2D;
typedef PFNGLCOPYTEXSUBIMAGE2DPROC PFN_glCopyTexSubImage2D;
typedef PFNGLCREATEPROGRAMPROC PFN_glCreateProgram;

typedef PFNGLGETSEMAPHOREPARAMETERIVNVPROC PFN_glGetSemaphoreParameterivNV;
typedef PFNGLVIEWPORTARRAYVNVPROC PFN_glViewportArrayvNV;
typedef PFNGLVIEWPORTINDEXEDFNVPROC PFN_glViewportIndexedfNV;
typedef PFNGLVIEWPORTINDEXEDFVNVPROC PFN_glViewportIndexedfvNV;
typedef PFNGLSCISSORARRAYVNVPROC PFN_glScissorArrayvNV;
typedef PFNGLSCISSORINDEXEDNVPROC PFN_glScissorIndexedNV;
typedef PFNGLSCISSORINDEXEDVNVPROC PFN_glScissorIndexedvNV;
typedef PFNGLDEPTHRANGEARRAYFVNVPROC PFN_glDepthRangeArrayfvNV;
typedef PFNGLDEPTHRANGEINDEXEDFNVPROC PFN_glDepthRangeIndexedfNV;
typedef PFNGLGETFLOATI_VNVPROC PFN_glGetFloati_vNV;
typedef PFNGLENABLEINVPROC PFN_glEnableiNV;
typedef PFNGLDISABLEINVPROC PFN_glDisableiNV;
typedef PFNGLISENABLEDINVPROC PFN_glIsEnablediNV;
typedef PFNGLVIEWPORTSWIZZLENVPROC PFN_glViewportSwizzleNV;
typedef PFNGLFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC
    PFN_glFramebufferTextureMultiviewOVR;
typedef PFNGLFRAMEBUFFERTEXTUREMULTISAMPLEMULTIVIEWOVRPROC
    PFN_glFramebufferTextureMultisampleMultiviewOVR;
typedef PFNGLALPHAFUNCQCOMPROC PFN_glAlphaFuncQCOM;
typedef PFNGLGETDRIVERCONTROLSQCOMPROC PFN_glGetDriverControlsQCOM;
typedef PFNGLGETDRIVERCONTROLSTRINGQCOMPROC PFN_glGetDriverControlStringQCOM;
typedef PFNGLENABLEDRIVERCONTROLQCOMPROC PFN_glEnableDriverControlQCOM;
typedef PFNGLDISABLEDRIVERCONTROLQCOMPROC PFN_glDisableDriverControlQCOM;
typedef PFNGLEXTGETTEXTURESQCOMPROC PFN_glExtGetTexturesQCOM;
typedef PFNGLEXTGETBUFFERSQCOMPROC PFN_glExtGetBuffersQCOM;
typedef PFNGLEXTGETRENDERBUFFERSQCOMPROC PFN_glExtGetRenderbuffersQCOM;
typedef PFNGLEXTGETFRAMEBUFFERSQCOMPROC PFN_glExtGetFramebuffersQCOM;
typedef PFNGLEXTGETTEXLEVELPARAMETERIVQCOMPROC
    PFN_glExtGetTexLevelParameterivQCOM;
typedef PFNGLEXTTEXOBJECTSTATEOVERRIDEIQCOMPROC
    PFN_glExtTexObjectStateOverrideiQCOM;
typedef PFNGLEXTGETTEXSUBIMAGEQCOMPROC PFN_glExtGetTexSubImageQCOM;
typedef PFNGLEXTGETBUFFERPOINTERVQCOMPROC PFN_glExtGetBufferPointervQCOM;
typedef PFNGLEXTGETSHADERSQCOMPROC PFN_glExtGetShadersQCOM;
typedef PFNGLEXTGETPROGRAMSQCOMPROC PFN_glExtGetProgramsQCOM;
typedef PFNGLEXTISPROGRAMBINARYQCOMPROC PFN_glExtIsProgramBinaryQCOM;
typedef PFNGLEXTGETPROGRAMBINARYSOURCEQCOMPROC
    PFN_glExtGetProgramBinarySourceQCOM;
typedef PFNGLEXTRAPOLATETEX2DQCOMPROC PFN_glExtrapolateTex2DQCOM;
typedef PFNGLFRAMEBUFFERFOVEATIONCONFIGQCOMPROC
    PFN_glFramebufferFoveationConfigQCOM;
typedef PFNGLFRAMEBUFFERFOVEATIONPARAMETERSQCOMPROC
    PFN_glFramebufferFoveationParametersQCOM;
typedef PFNGLTEXESTIMATEMOTIONQCOMPROC PFN_glTexEstimateMotionQCOM;
typedef PFNGLTEXESTIMATEMOTIONREGIONSQCOMPROC
    PFN_glTexEstimateMotionRegionsQCOM;
typedef PFNGLFRAMEBUFFERFETCHBARRIERQCOMPROC PFN_glFramebufferFetchBarrierQCOM;
typedef PFNGLSHADINGRATEQCOMPROC PFN_glShadingRateQCOM;
typedef PFNGLTEXTUREFOVEATIONPARAMETERSQCOMPROC
    PFN_glTextureFoveationParametersQCOM;
typedef PFNGLSTARTTILINGQCOMPROC PFN_glStartTilingQCOM;
typedef PFNGLENDTILINGQCOMPROC PFN_glEndTilingQCOM;
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class GLES2LoaderLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 135) {}
    bool IS_LOAD_GL_ES_VERSION_2_0 : 1;                               // 0
    bool IS_LOAD_GL_ES_VERSION_3_0 : 1;                               // 1
    bool IS_LOAD_GL_ES_VERSION_3_1 : 1;                               // 2
    bool IS_LOAD_GL_ES_VERSION_3_2 : 1;                               // 3
    bool IS_LOAD_GL_KHR_blend_equation_advanced : 1;                  // 4
    bool IS_LOAD_GL_KHR_debug : 1;                                    // 5
    bool IS_LOAD_GL_KHR_parallel_shader_compile : 1;                  // 6
    bool IS_LOAD_GL_KHR_robustness : 1;                               // 7
    bool IS_LOAD_GL_OES_EGL_image : 1;                                // 8
    bool IS_LOAD_GL_OES_copy_image : 1;                               // 9
    bool IS_LOAD_GL_OES_draw_buffers_indexed : 1;                     // 10
    bool IS_LOAD_GL_OES_draw_elements_base_vertex : 1;                // 11
    bool IS_LOAD_GL_OES_geometry_shader : 1;                          // 12
    bool IS_LOAD_GL_OES_get_program_binary : 1;                       // 13
    bool IS_LOAD_GL_OES_mapbuffer : 1;                                // 14
    bool IS_LOAD_GL_OES_primitive_bounding_box : 1;                   // 15
    bool IS_LOAD_GL_OES_sample_shading : 1;                           // 16
    bool IS_LOAD_GL_OES_tessellation_shader : 1;                      // 17
    bool IS_LOAD_GL_OES_texture_3D : 1;                               // 18
    bool IS_LOAD_GL_OES_texture_border_clamp : 1;                     // 19
    bool IS_LOAD_GL_OES_texture_buffer : 1;                           // 20
    bool IS_LOAD_GL_OES_texture_storage_multisample_2d_array : 1;     // 21
    bool IS_LOAD_GL_OES_texture_view : 1;                             // 22
    bool IS_LOAD_GL_OES_vertex_array_object : 1;                      // 23
    bool IS_LOAD_GL_OES_viewport_array : 1;                           // 24
    bool IS_LOAD_GL_AMD_framebuffer_multisample_advanced : 1;         // 25
    bool IS_LOAD_GL_AMD_performance_monitor : 1;                      // 26
    bool IS_LOAD_GL_ANGLE_framebuffer_blit : 1;                       // 27
    bool IS_LOAD_GL_ANGLE_framebuffer_multisample : 1;                // 28
    bool IS_LOAD_GL_ANGLE_instanced_arrays : 1;                       // 29
    bool IS_LOAD_GL_ANGLE_translated_shader_source : 1;               // 30
    bool IS_LOAD_GL_APPLE_copy_texture_levels : 1;                    // 31
    bool IS_LOAD_GL_APPLE_framebuffer_multisample : 1;                // 32
    bool IS_LOAD_GL_APPLE_sync : 1;                                   // 33
    bool IS_LOAD_GL_ARM_shader_core_properties : 1;                   // 34
    bool IS_LOAD_GL_EXT_EGL_image_storage : 1;                        // 35
    bool IS_LOAD_GL_EXT_base_instance : 1;                            // 36
    bool IS_LOAD_GL_EXT_blend_func_extended : 1;                      // 37
    bool IS_LOAD_GL_EXT_buffer_storage : 1;                           // 38
    bool IS_LOAD_GL_EXT_clear_texture : 1;                            // 39
    bool IS_LOAD_GL_EXT_clip_control : 1;                             // 40
    bool IS_LOAD_GL_EXT_copy_image : 1;                               // 41
    bool IS_LOAD_GL_EXT_debug_label : 1;                              // 42
    bool IS_LOAD_GL_EXT_debug_marker : 1;                             // 43
    bool IS_LOAD_GL_EXT_discard_framebuffer : 1;                      // 44
    bool IS_LOAD_GL_EXT_disjoint_timer_query : 1;                     // 45
    bool IS_LOAD_GL_EXT_draw_buffers : 1;                             // 46
    bool IS_LOAD_GL_EXT_draw_buffers_indexed : 1;                     // 47
    bool IS_LOAD_GL_EXT_draw_elements_base_vertex : 1;                // 48
    bool IS_LOAD_GL_EXT_draw_instanced : 1;                           // 49
    bool IS_LOAD_GL_EXT_draw_transform_feedback : 1;                  // 50
    bool IS_LOAD_GL_EXT_external_buffer : 1;                          // 51
    bool IS_LOAD_GL_EXT_fragment_shading_rate : 1;                    // 52
    bool IS_LOAD_GL_EXT_framebuffer_blit_layers : 1;                  // 53
    bool IS_LOAD_GL_EXT_geometry_shader : 1;                          // 54
    bool IS_LOAD_GL_EXT_instanced_arrays : 1;                         // 55
    bool IS_LOAD_GL_EXT_map_buffer_range : 1;                         // 56
    bool IS_LOAD_GL_EXT_memory_object : 1;                            // 57
    bool IS_LOAD_GL_EXT_memory_object_fd : 1;                         // 58
    bool IS_LOAD_GL_EXT_memory_object_win32 : 1;                      // 59
    bool IS_LOAD_GL_EXT_multi_draw_arrays : 1;                        // 60
    bool IS_LOAD_GL_EXT_multi_draw_indirect : 1;                      // 61
    bool IS_LOAD_GL_EXT_multisampled_render_to_texture : 1;           // 62
    bool IS_LOAD_GL_EXT_multiview_draw_buffers : 1;                   // 63
    bool IS_LOAD_GL_EXT_polygon_offset_clamp : 1;                     // 64
    bool IS_LOAD_GL_EXT_primitive_bounding_box : 1;                   // 65
    bool IS_LOAD_GL_EXT_raster_multisample : 1;                       // 66
    bool IS_LOAD_GL_EXT_robustness : 1;                               // 67
    bool IS_LOAD_GL_EXT_semaphore : 1;                                // 68
    bool IS_LOAD_GL_EXT_semaphore_fd : 1;                             // 69
    bool IS_LOAD_GL_EXT_semaphore_win32 : 1;                          // 70
    bool IS_LOAD_GL_EXT_separate_shader_objects : 1;                  // 71
    bool IS_LOAD_GL_EXT_shader_framebuffer_fetch_non_coherent : 1;    // 72
    bool IS_LOAD_GL_EXT_shader_pixel_local_storage2 : 1;              // 73
    bool IS_LOAD_GL_EXT_sparse_texture : 1;                           // 74
    bool IS_LOAD_GL_EXT_tessellation_shader : 1;                      // 75
    bool IS_LOAD_GL_EXT_texture_border_clamp : 1;                     // 76
    bool IS_LOAD_GL_EXT_texture_buffer : 1;                           // 77
    bool IS_LOAD_GL_EXT_texture_storage : 1;                          // 78
    bool IS_LOAD_GL_EXT_texture_storage_compression : 1;              // 79
    bool IS_LOAD_GL_EXT_texture_view : 1;                             // 80
    bool IS_LOAD_GL_EXT_win32_keyed_mutex : 1;                        // 81
    bool IS_LOAD_GL_EXT_window_rectangles : 1;                        // 82
    bool IS_LOAD_GL_IMG_bindless_texture : 1;                         // 83
    bool IS_LOAD_GL_IMG_framebuffer_downsample : 1;                   // 84
    bool IS_LOAD_GL_IMG_multisampled_render_to_texture : 1;           // 85
    bool IS_LOAD_GL_INTEL_framebuffer_CMAA : 1;                       // 86
    bool IS_LOAD_GL_INTEL_performance_query : 1;                      // 87
    bool IS_LOAD_GL_MESA_framebuffer_flip_y : 1;                      // 88
    bool IS_LOAD_GL_MESA_sampler_objects : 1;                         // 89
    bool IS_LOAD_GL_NV_bindless_texture : 1;                          // 90
    bool IS_LOAD_GL_NV_blend_equation_advanced : 1;                   // 91
    bool IS_LOAD_GL_NV_clip_space_w_scaling : 1;                      // 92
    bool IS_LOAD_GL_NV_conditional_render : 1;                        // 93
    bool IS_LOAD_GL_NV_conservative_raster : 1;                       // 94
    bool IS_LOAD_GL_NV_conservative_raster_pre_snap_triangles : 1;    // 95
    bool IS_LOAD_GL_NV_copy_buffer : 1;                               // 96
    bool IS_LOAD_GL_NV_coverage_sample : 1;                           // 97
    bool IS_LOAD_GL_NV_draw_buffers : 1;                              // 98
    bool IS_LOAD_GL_NV_draw_instanced : 1;                            // 99
    bool IS_LOAD_GL_NV_draw_vulkan_image : 1;                         // 100
    bool IS_LOAD_GL_NV_fence : 1;                                     // 101
    bool IS_LOAD_GL_NV_fragment_coverage_to_color : 1;                // 102
    bool IS_LOAD_GL_NV_framebuffer_blit : 1;                          // 103
    bool IS_LOAD_GL_NV_framebuffer_mixed_samples : 1;                 // 104
    bool IS_LOAD_GL_NV_framebuffer_multisample : 1;                   // 105
    bool IS_LOAD_GL_NV_gpu_shader5 : 1;                               // 106
    bool IS_LOAD_GL_NV_instanced_arrays : 1;                          // 107
    bool IS_LOAD_GL_NV_internalformat_sample_query : 1;               // 108
    bool IS_LOAD_GL_NV_memory_attachment : 1;                         // 109
    bool IS_LOAD_GL_NV_memory_object_sparse : 1;                      // 110
    bool IS_LOAD_GL_NV_mesh_shader : 1;                               // 111
    bool IS_LOAD_GL_NV_non_square_matrices : 1;                       // 112
    bool IS_LOAD_GL_NV_path_rendering : 1;                            // 113
    bool IS_LOAD_GL_NV_polygon_mode : 1;                              // 114
    bool IS_LOAD_GL_NV_read_buffer : 1;                               // 115
    bool IS_LOAD_GL_NV_sample_locations : 1;                          // 116
    bool IS_LOAD_GL_NV_scissor_exclusive : 1;                         // 117
    bool IS_LOAD_GL_NV_shading_rate_image : 1;                        // 118
    bool IS_LOAD_GL_NV_timeline_semaphore : 1;                        // 119
    bool IS_LOAD_GL_NV_viewport_array : 1;                            // 120
    bool IS_LOAD_GL_NV_viewport_swizzle : 1;                          // 121
    bool IS_LOAD_GL_OVR_multiview : 1;                                // 122
    bool IS_LOAD_GL_OVR_multiview_multisampled_render_to_texture : 1; // 123
    bool IS_LOAD_GL_QCOM_alpha_test : 1;                              // 124
    bool IS_LOAD_GL_QCOM_driver_control : 1;                          // 125
    bool IS_LOAD_GL_QCOM_extended_get : 1;                            // 126
    bool IS_LOAD_GL_QCOM_extended_get2 : 1;                           // 127
    bool IS_LOAD_GL_QCOM_frame_extrapolation : 1;                     // 128
    bool IS_LOAD_GL_QCOM_framebuffer_foveated : 1;                    // 129
    bool IS_LOAD_GL_QCOM_motion_estimation : 1;                       // 130
    bool IS_LOAD_GL_QCOM_shader_framebuffer_fetch_noncoherent : 1;    // 131
    bool IS_LOAD_GL_QCOM_shading_rate : 1;                            // 132
    bool IS_LOAD_GL_QCOM_texture_foveated : 1;                        // 133
    bool IS_LOAD_GL_QCOM_tiled_rendering : 1;                         // 134
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  GLES2LoaderLoader();
  // GL_APICALL void GL_APIENTRY glActiveTexture (GLenum texture);
  VKFUNDEFINE(glActiveTexture);
  // GL_APICALL void GL_APIENTRY glAttachShader (GLuint program, GLuint shader);
  VKFUNDEFINE(glAttachShader);
  // GL_APICALL void GL_APIENTRY glBindAttribLocation (GLuint program, GLuint
  // index, const GLchar *name);
  VKFUNDEFINE(glBindAttribLocation);
  // GL_APICALL void GL_APIENTRY glBindBuffer (GLenum target, GLuint buffer);
  VKFUNDEFINE(glBindBuffer);
  // GL_APICALL void GL_APIENTRY glBindFramebuffer (GLenum target, GLuint
  // framebuffer);
  VKFUNDEFINE(glBindFramebuffer);
