#pragma once
#include "../PhiLoader.hpp"
#include <GLES/gl.h>
#include <GLES/glext.h>
typedef void(GL_APIENTRY *PFN_glAlphaFunc)(GLenum func, GLfloat ref);
typedef void(GL_APIENTRY *PFN_glClearColor)(GLfloat red, GLfloat green,
                                            GLfloat blue, GLfloat alpha);
typedef void(GL_APIENTRY *PFN_glClearDepthf)(GLfloat d);
typedef void(GL_APIENTRY *PFN_glClipPlanef)(GLenum p, const GLfloat *eqn);
typedef void(GL_APIENTRY *PFN_glColor4f)(GLfloat red, GLfloat green,
                                         GLfloat blue, GLfloat alpha);
typedef void(GL_APIENTRY *PFN_glDepthRangef)(GLfloat n, GLfloat f);
typedef void(GL_APIENTRY *PFN_glFogf)(GLenum pname, GLfloat param);
typedef void(GL_APIENTRY *PFN_glFogfv)(GLenum pname, const GLfloat *params);
typedef void(GL_APIENTRY *PFN_glFrustumf)(GLfloat l, GLfloat r, GLfloat b,
                                          GLfloat t, GLfloat n, GLfloat f);
typedef void(GL_APIENTRY *PFN_glGetClipPlanef)(GLenum plane, GLfloat *equation);
typedef void(GL_APIENTRY *PFN_glGetFloatv)(GLenum pname, GLfloat *data);
typedef void(GL_APIENTRY *PFN_glGetLightfv)(GLenum light, GLenum pname,
                                            GLfloat *params);
typedef void(GL_APIENTRY *PFN_glGetMaterialfv)(GLenum face, GLenum pname,
                                               GLfloat *params);
typedef void(GL_APIENTRY *PFN_glGetTexEnvfv)(GLenum target, GLenum pname,

typedef void(GL_APIENTRY *PFN_glGetDriverControlsQCOM)(GLint *num, GLsizei size,
                                                       GLuint *driverControls);
typedef void(GL_APIENTRY *PFN_glGetDriverControlStringQCOM)(
    GLuint driverControl, GLsizei bufSize, GLsizei *length,
    GLchar *driverControlString);
typedef void(GL_APIENTRY *PFN_glEnableDriverControlQCOM)(GLuint driverControl);
typedef void(GL_APIENTRY *PFN_glDisableDriverControlQCOM)(GLuint driverControl);
typedef void(GL_APIENTRY *PFN_glExtGetTexturesQCOM)(GLuint *textures,
                                                    GLint maxTextures,
                                                    GLint *numTextures);
typedef void(GL_APIENTRY *PFN_glExtGetBuffersQCOM)(GLuint *buffers,
                                                   GLint maxBuffers,
                                                   GLint *numBuffers);
typedef void(GL_APIENTRY *PFN_glExtGetRenderbuffersQCOM)(
    GLuint *renderbuffers, GLint maxRenderbuffers, GLint *numRenderbuffers);
typedef void(GL_APIENTRY *PFN_glExtGetFramebuffersQCOM)(GLuint *framebuffers,
                                                        GLint maxFramebuffers,
                                                        GLint *numFramebuffers);
typedef void(GL_APIENTRY *PFN_glExtGetTexLevelParameterivQCOM)(
    GLuint texture, GLenum face, GLint level, GLenum pname, GLint *params);
typedef void(GL_APIENTRY *PFN_glExtTexObjectStateOverrideiQCOM)(GLenum target,
                                                                GLenum pname,
                                                                GLint param);
typedef void(GL_APIENTRY *PFN_glExtGetTexSubImageQCOM)(
    GLenum target, GLint level, GLint xoffset, GLint yoffset, GLint zoffset,
    GLsizei width, GLsizei height, GLsizei depth, GLenum format, GLenum type,
    void *texels);
typedef void(GL_APIENTRY *PFN_glExtGetBufferPointervQCOM)(GLenum target,
                                                          void **params);
typedef void(GL_APIENTRY *PFN_glExtGetShadersQCOM)(GLuint *shaders,
                                                   GLint maxShaders,
                                                   GLint *numShaders);
typedef void(GL_APIENTRY *PFN_glExtGetProgramsQCOM)(GLuint *programs,
                                                    GLint maxPrograms,
                                                    GLint *numPrograms);
typedef GLboolean(GL_APIENTRY *PFN_glExtIsProgramBinaryQCOM)(GLuint program);
typedef void(GL_APIENTRY *PFN_glExtGetProgramBinarySourceQCOM)(
    GLuint program, GLenum shadertype, GLchar *source, GLint *length);
typedef void(GL_APIENTRY *PFN_glStartTilingQCOM)(GLuint x, GLuint y,
                                                 GLuint width, GLuint height,
                                                 GLbitfield preserveMask);
typedef void(GL_APIENTRY *PFN_glEndTilingQCOM)(GLbitfield preserveMask);
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class GLESLoaderLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 32) {}
    bool IS_LOAD_GL_VERSION_ES_CM_1_0 : 1;                  // 0
    bool IS_LOAD_GL_OES_point_size_array : 1;               // 1
    bool IS_LOAD_GL_OES_EGL_image : 1;                      // 2
    bool IS_LOAD_GL_OES_blend_equation_separate : 1;        // 3
    bool IS_LOAD_GL_OES_blend_func_separate : 1;            // 4
    bool IS_LOAD_GL_OES_blend_subtract : 1;                 // 5
    bool IS_LOAD_GL_OES_draw_texture : 1;                   // 6
    bool IS_LOAD_GL_OES_fixed_point : 1;                    // 7
    bool IS_LOAD_GL_OES_framebuffer_object : 1;             // 8
    bool IS_LOAD_GL_OES_mapbuffer : 1;                      // 9
    bool IS_LOAD_GL_OES_matrix_palette : 1;                 // 10
    bool IS_LOAD_GL_OES_query_matrix : 1;                   // 11
    bool IS_LOAD_GL_OES_single_precision : 1;               // 12
    bool IS_LOAD_GL_OES_texture_cube_map : 1;               // 13
    bool IS_LOAD_GL_OES_vertex_array_object : 1;            // 14
    bool IS_LOAD_GL_APPLE_copy_texture_levels : 1;          // 15
    bool IS_LOAD_GL_APPLE_framebuffer_multisample : 1;      // 16
    bool IS_LOAD_GL_APPLE_sync : 1;                         // 17
    bool IS_LOAD_GL_EXT_debug_marker : 1;                   // 18
    bool IS_LOAD_GL_EXT_discard_framebuffer : 1;            // 19
    bool IS_LOAD_GL_EXT_map_buffer_range : 1;               // 20
    bool IS_LOAD_GL_EXT_multi_draw_arrays : 1;              // 21
    bool IS_LOAD_GL_EXT_multisampled_render_to_texture : 1; // 22
    bool IS_LOAD_GL_EXT_robustness : 1;                     // 23
    bool IS_LOAD_GL_EXT_texture_storage : 1;                // 24
    bool IS_LOAD_GL_IMG_multisampled_render_to_texture : 1; // 25
    bool IS_LOAD_GL_IMG_user_clip_plane : 1;                // 26
    bool IS_LOAD_GL_NV_fence : 1;                           // 27
    bool IS_LOAD_GL_QCOM_driver_control : 1;                // 28
    bool IS_LOAD_GL_QCOM_extended_get : 1;                  // 29
    bool IS_LOAD_GL_QCOM_extended_get2 : 1;                 // 30
    bool IS_LOAD_GL_QCOM_tiled_rendering : 1;               // 31
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  GLESLoaderLoader();
  // GL_API void GL_APIENTRY glAlphaFunc (GLenum func, GLfloat ref);
  VKFUNDEFINE(glAlphaFunc);
  // GL_API void GL_APIENTRY glClearColor (GLfloat red, GLfloat green, GLfloat
  // blue, GLfloat alpha);
  VKFUNDEFINE(glClearColor);
  // GL_API void GL_APIENTRY glClearDepthf (GLfloat d);
  VKFUNDEFINE(glClearDepthf);
  // GL_API void GL_APIENTRY glClipPlanef (GLenum p, const GLfloat *eqn);
  VKFUNDEFINE(glClipPlanef);
  // GL_API void GL_APIENTRY glColor4f (GLfloat red, GLfloat green, GLfloat
  // blue, GLfloat alpha);
  VKFUNDEFINE(glColor4f);
  // GL_API void GL_APIENTRY glDepthRangef (GLfloat n, GLfloat f);
  VKFUNDEFINE(glDepthRangef);
