#pragma once
#include "../PhiLoader.hpp"
#include <GL/glcorearb.h>
#include <GL/glext.h>
typedef PFNGLDRAWRANGEELEMENTSPROC PFN_glDrawRangeElements;
typedef PFNGLTEXIMAGE3DPROC PFN_glTexImage3D;
typedef PFNGLTEXSUBIMAGE3DPROC PFN_glTexSubImage3D;
typedef PFNGLCOPYTEXSUBIMAGE3DPROC PFN_glCopyTexSubImage3D;
typedef PFNGLACTIVETEXTUREPROC PFN_glActiveTexture;
typedef PFNGLSAMPLECOVERAGEPROC PFN_glSampleCoverage;
typedef PFNGLCOMPRESSEDTEXIMAGE3DPROC PFN_glCompressedTexImage3D;
typedef PFNGLCOMPRESSEDTEXIMAGE2DPROC PFN_glCompressedTexImage2D;
typedef PFNGLCOMPRESSEDTEXIMAGE1DPROC PFN_glCompressedTexImage1D;
typedef PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC PFN_glCompressedTexSubImage3D;
typedef PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC PFN_glCompressedTexSubImage2D;
typedef PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC PFN_glCompressedTexSubImage1D;
typedef PFNGLGETCOMPRESSEDTEXIMAGEPROC PFN_glGetCompressedTexImage;
typedef PFNGLCLIENTACTIVETEXTUREPROC PFN_glClientActiveTexture;
typedef PFNGLMULTITEXCOORD1DPROC PFN_glMultiTexCoord1d;
typedef PFNGLMULTITEXCOORD1DVPROC PFN_glMultiTexCoord1dv;
typedef PFNGLMULTITEXCOORD1FPROC PFN_glMultiTexCoord1f;
typedef PFNGLMULTITEXCOORD1FVPROC PFN_glMultiTexCoord1fv;
typedef PFNGLMULTITEXCOORD1IPROC PFN_glMultiTexCoord1i;
typedef PFNGLMULTITEXCOORD1IVPROC PFN_glMultiTexCoord1iv;
typedef PFNGLMULTITEXCOORD1SPROC PFN_glMultiTexCoord1s;
typedef PFNGLMULTITEXCOORD1SVPROC PFN_glMultiTexCoord1sv;
typedef PFNGLMULTITEXCOORD2DPROC PFN_glMultiTexCoord2d;

typedef PFNGLCULLFACEPROC PFN_glCullFace;
typedef PFNGLFRONTFACEPROC PFN_glFrontFace;
typedef PFNGLHINTPROC PFN_glHint;
typedef PFNGLLINEWIDTHPROC PFN_glLineWidth;
typedef PFNGLPOINTSIZEPROC PFN_glPointSize;
typedef PFNGLPOLYGONMODEPROC PFN_glPolygonMode;
typedef PFNGLSCISSORPROC PFN_glScissor;
typedef PFNGLTEXPARAMETERFPROC PFN_glTexParameterf;
typedef PFNGLTEXPARAMETERFVPROC PFN_glTexParameterfv;
typedef PFNGLTEXPARAMETERIPROC PFN_glTexParameteri;
typedef PFNGLTEXPARAMETERIVPROC PFN_glTexParameteriv;
typedef PFNGLTEXIMAGE1DPROC PFN_glTexImage1D;
typedef PFNGLTEXIMAGE2DPROC PFN_glTexImage2D;
typedef PFNGLDRAWBUFFERPROC PFN_glDrawBuffer;
typedef PFNGLCLEARPROC PFN_glClear;
typedef PFNGLCLEARCOLORPROC PFN_glClearColor;
typedef PFNGLCLEARSTENCILPROC PFN_glClearStencil;
typedef PFNGLCLEARDEPTHPROC PFN_glClearDepth;
typedef PFNGLSTENCILMASKPROC PFN_glStencilMask;
typedef PFNGLCOLORMASKPROC PFN_glColorMask;
typedef PFNGLDEPTHMASKPROC PFN_glDepthMask;
typedef PFNGLDISABLEPROC PFN_glDisable;
typedef PFNGLENABLEPROC PFN_glEnable;
typedef PFNGLFINISHPROC PFN_glFinish;
typedef PFNGLFLUSHPROC PFN_glFlush;
typedef PFNGLBLENDFUNCPROC PFN_glBlendFunc;
typedef PFNGLLOGICOPPROC PFN_glLogicOp;
typedef PFNGLSTENCILFUNCPROC PFN_glStencilFunc;
typedef PFNGLSTENCILOPPROC PFN_glStencilOp;
typedef PFNGLDEPTHFUNCPROC PFN_glDepthFunc;
typedef PFNGLPIXELSTOREFPROC PFN_glPixelStoref;
typedef PFNGLPIXELSTOREIPROC PFN_glPixelStorei;
typedef PFNGLREADBUFFERPROC PFN_glReadBuffer;
typedef PFNGLREADPIXELSPROC PFN_glReadPixels;
typedef PFNGLGETBOOLEANVPROC PFN_glGetBooleanv;
typedef PFNGLGETDOUBLEVPROC PFN_glGetDoublev;
typedef PFNGLGETERRORPROC PFN_glGetError;
typedef PFNGLGETFLOATVPROC PFN_glGetFloatv;
typedef PFNGLGETINTEGERVPROC PFN_glGetIntegerv;
typedef PFNGLGETSTRINGPROC PFN_glGetString;
typedef PFNGLGETTEXIMAGEPROC PFN_glGetTexImage;
typedef PFNGLGETTEXPARAMETERFVPROC PFN_glGetTexParameterfv;
typedef PFNGLGETTEXPARAMETERIVPROC PFN_glGetTexParameteriv;
typedef PFNGLGETTEXLEVELPARAMETERFVPROC PFN_glGetTexLevelParameterfv;
typedef PFNGLGETTEXLEVELPARAMETERIVPROC PFN_glGetTexLevelParameteriv;
typedef PFNGLISENABLEDPROC PFN_glIsEnabled;
typedef PFNGLDEPTHRANGEPROC PFN_glDepthRange;
typedef PFNGLVIEWPORTPROC PFN_glViewport;
typedef PFNGLDRAWARRAYSPROC PFN_glDrawArrays;
typedef PFNGLDRAWELEMENTSPROC PFN_glDrawElements;
typedef PFNGLGETPOINTERVPROC PFN_glGetPointerv;
typedef PFNGLPOLYGONOFFSETPROC PFN_glPolygonOffset;
typedef PFNGLCOPYTEXIMAGE1DPROC PFN_glCopyTexImage1D;
typedef PFNGLCOPYTEXIMAGE2DPROC PFN_glCopyTexImage2D;
typedef PFNGLCOPYTEXSUBIMAGE1DPROC PFN_glCopyTexSubImage1D;
typedef PFNGLCOPYTEXSUBIMAGE2DPROC PFN_glCopyTexSubImage2D;
typedef PFNGLTEXSUBIMAGE1DPROC PFN_glTexSubImage1D;
typedef PFNGLTEXSUBIMAGE2DPROC PFN_glTexSubImage2D;
typedef PFNGLBINDTEXTUREPROC PFN_glBindTexture;
typedef PFNGLDELETETEXTURESPROC PFN_glDeleteTextures;
typedef PFNGLGENTEXTURESPROC PFN_glGenTextures;
typedef PFNGLISTEXTUREPROC PFN_glIsTexture;
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class OpenGLLoaderLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 273) {}
    bool IS_LOAD_GL_VERSION_1_2 : 1;                               // 0
    bool IS_LOAD_GL_VERSION_1_3 : 1;                               // 1
    bool IS_LOAD_GL_VERSION_1_4 : 1;                               // 2
    bool IS_LOAD_GL_VERSION_1_5 : 1;                               // 3
    bool IS_LOAD_GL_VERSION_2_0 : 1;                               // 4
    bool IS_LOAD_GL_VERSION_2_1 : 1;                               // 5
    bool IS_LOAD_GL_VERSION_3_0 : 1;                               // 6
    bool IS_LOAD_GL_VERSION_3_1 : 1;                               // 7
    bool IS_LOAD_GL_VERSION_3_2 : 1;                               // 8
    bool IS_LOAD_GL_VERSION_3_3 : 1;                               // 9
    bool IS_LOAD_GL_VERSION_4_0 : 1;                               // 10
    bool IS_LOAD_GL_VERSION_4_1 : 1;                               // 11
    bool IS_LOAD_GL_VERSION_4_2 : 1;                               // 12
    bool IS_LOAD_GL_VERSION_4_3 : 1;                               // 13
    bool IS_LOAD_GL_VERSION_4_4 : 1;                               // 14
    bool IS_LOAD_GL_VERSION_4_5 : 1;                               // 15
    bool IS_LOAD_GL_VERSION_4_6 : 1;                               // 16
    bool IS_LOAD_GL_ARB_ES3_2_compatibility : 1;                   // 17
    bool IS_LOAD_GL_ARB_bindless_texture : 1;                      // 18
    bool IS_LOAD_GL_ARB_cl_event : 1;                              // 19
    bool IS_LOAD_GL_ARB_color_buffer_float : 1;                    // 20
    bool IS_LOAD_GL_ARB_compute_variable_group_size : 1;           // 21
    bool IS_LOAD_GL_ARB_debug_output : 1;                          // 22
    bool IS_LOAD_GL_ARB_draw_buffers : 1;                          // 23
    bool IS_LOAD_GL_ARB_draw_buffers_blend : 1;                    // 24
    bool IS_LOAD_GL_ARB_draw_instanced : 1;                        // 25
    bool IS_LOAD_GL_ARB_fragment_program : 1;                      // 26
    bool IS_LOAD_GL_ARB_geometry_shader4 : 1;                      // 27
    bool IS_LOAD_GL_ARB_gl_spirv : 1;                              // 28
    bool IS_LOAD_GL_ARB_gpu_shader_int64 : 1;                      // 29
    bool IS_LOAD_GL_ARB_imaging : 1;                               // 30
    bool IS_LOAD_GL_ARB_indirect_parameters : 1;                   // 31
    bool IS_LOAD_GL_ARB_instanced_arrays : 1;                      // 32
    bool IS_LOAD_GL_ARB_matrix_palette : 1;                        // 33
    bool IS_LOAD_GL_ARB_multisample : 1;                           // 34
    bool IS_LOAD_GL_ARB_multitexture : 1;                          // 35
    bool IS_LOAD_GL_ARB_occlusion_query : 1;                       // 36
    bool IS_LOAD_GL_ARB_parallel_shader_compile : 1;               // 37
    bool IS_LOAD_GL_ARB_point_parameters : 1;                      // 38
    bool IS_LOAD_GL_ARB_robustness : 1;                            // 39
    bool IS_LOAD_GL_ARB_sample_locations : 1;                      // 40
    bool IS_LOAD_GL_ARB_sample_shading : 1;                        // 41
    bool IS_LOAD_GL_ARB_shader_objects : 1;                        // 42
    bool IS_LOAD_GL_ARB_shading_language_include : 1;              // 43
    bool IS_LOAD_GL_ARB_sparse_buffer : 1;                         // 44
    bool IS_LOAD_GL_ARB_sparse_texture : 1;                        // 45
    bool IS_LOAD_GL_ARB_texture_buffer_object : 1;                 // 46
    bool IS_LOAD_GL_ARB_texture_compression : 1;                   // 47
    bool IS_LOAD_GL_ARB_transpose_matrix : 1;                      // 48
    bool IS_LOAD_GL_ARB_vertex_blend : 1;                          // 49
    bool IS_LOAD_GL_ARB_vertex_buffer_object : 1;                  // 50
    bool IS_LOAD_GL_ARB_vertex_program : 1;                        // 51
    bool IS_LOAD_GL_ARB_vertex_shader : 1;                         // 52
    bool IS_LOAD_GL_ARB_viewport_array : 1;                        // 53
    bool IS_LOAD_GL_ARB_window_pos : 1;                            // 54
    bool IS_LOAD_GL_KHR_blend_equation_advanced : 1;               // 55
    bool IS_LOAD_GL_KHR_parallel_shader_compile : 1;               // 56
    bool IS_LOAD_GL_OES_byte_coordinates : 1;                      // 57
    bool IS_LOAD_GL_OES_fixed_point : 1;                           // 58
    bool IS_LOAD_GL_OES_query_matrix : 1;                          // 59
    bool IS_LOAD_GL_OES_single_precision : 1;                      // 60
    bool IS_LOAD_GL_3DFX_tbuffer : 1;                              // 61
    bool IS_LOAD_GL_AMD_debug_output : 1;                          // 62
    bool IS_LOAD_GL_AMD_draw_buffers_blend : 1;                    // 63
    bool IS_LOAD_GL_AMD_framebuffer_multisample_advanced : 1;      // 64
    bool IS_LOAD_GL_AMD_framebuffer_sample_positions : 1;          // 65
    bool IS_LOAD_GL_AMD_gpu_shader_int64 : 1;                      // 66
    bool IS_LOAD_GL_AMD_interleaved_elements : 1;                  // 67
    bool IS_LOAD_GL_AMD_multi_draw_indirect : 1;                   // 68
    bool IS_LOAD_GL_AMD_name_gen_delete : 1;                       // 69
    bool IS_LOAD_GL_AMD_occlusion_query_event : 1;                 // 70
    bool IS_LOAD_GL_AMD_performance_monitor : 1;                   // 71
    bool IS_LOAD_GL_AMD_sample_positions : 1;                      // 72
    bool IS_LOAD_GL_AMD_sparse_texture : 1;                        // 73
    bool IS_LOAD_GL_AMD_stencil_operation_extended : 1;            // 74
    bool IS_LOAD_GL_AMD_vertex_shader_tessellator : 1;             // 75
    bool IS_LOAD_GL_APPLE_element_array : 1;                       // 76
    bool IS_LOAD_GL_APPLE_fence : 1;                               // 77
    bool IS_LOAD_GL_APPLE_flush_buffer_range : 1;                  // 78
    bool IS_LOAD_GL_APPLE_object_purgeable : 1;                    // 79
    bool IS_LOAD_GL_APPLE_texture_range : 1;                       // 80
    bool IS_LOAD_GL_APPLE_vertex_array_object : 1;                 // 81
    bool IS_LOAD_GL_APPLE_vertex_array_range : 1;                  // 82
    bool IS_LOAD_GL_APPLE_vertex_program_evaluators : 1;           // 83
    bool IS_LOAD_GL_ATI_draw_buffers : 1;                          // 84
    bool IS_LOAD_GL_ATI_element_array : 1;                         // 85
    bool IS_LOAD_GL_ATI_envmap_bumpmap : 1;                        // 86
    bool IS_LOAD_GL_ATI_fragment_shader : 1;                       // 87
    bool IS_LOAD_GL_ATI_map_object_buffer : 1;                     // 88
    bool IS_LOAD_GL_ATI_pn_triangles : 1;                          // 89
    bool IS_LOAD_GL_ATI_separate_stencil : 1;                      // 90
    bool IS_LOAD_GL_ATI_vertex_array_object : 1;                   // 91
    bool IS_LOAD_GL_ATI_vertex_attrib_array_object : 1;            // 92
    bool IS_LOAD_GL_ATI_vertex_streams : 1;                        // 93
    bool IS_LOAD_GL_EXT_EGL_image_storage : 1;                     // 94
    bool IS_LOAD_GL_EXT_bindable_uniform : 1;                      // 95
    bool IS_LOAD_GL_EXT_blend_color : 1;                           // 96
    bool IS_LOAD_GL_EXT_blend_equation_separate : 1;               // 97
    bool IS_LOAD_GL_EXT_blend_func_separate : 1;                   // 98
    bool IS_LOAD_GL_EXT_blend_minmax : 1;                          // 99
    bool IS_LOAD_GL_EXT_color_subtable : 1;                        // 100
    bool IS_LOAD_GL_EXT_compiled_vertex_array : 1;                 // 101
    bool IS_LOAD_GL_EXT_convolution : 1;                           // 102
    bool IS_LOAD_GL_EXT_coordinate_frame : 1;                      // 103
    bool IS_LOAD_GL_EXT_copy_texture : 1;                          // 104
    bool IS_LOAD_GL_EXT_cull_vertex : 1;                           // 105
    bool IS_LOAD_GL_EXT_debug_label : 1;                           // 106
    bool IS_LOAD_GL_EXT_debug_marker : 1;                          // 107
    bool IS_LOAD_GL_EXT_depth_bounds_test : 1;                     // 108
    bool IS_LOAD_GL_EXT_direct_state_access : 1;                   // 109
    bool IS_LOAD_GL_EXT_draw_buffers2 : 1;                         // 110
    bool IS_LOAD_GL_EXT_draw_instanced : 1;                        // 111
    bool IS_LOAD_GL_EXT_draw_range_elements : 1;                   // 112
    bool IS_LOAD_GL_EXT_external_buffer : 1;                       // 113
    bool IS_LOAD_GL_EXT_fog_coord : 1;                             // 114
    bool IS_LOAD_GL_EXT_framebuffer_blit : 1;                      // 115
    bool IS_LOAD_GL_EXT_framebuffer_blit_layers : 1;               // 116
    bool IS_LOAD_GL_EXT_framebuffer_multisample : 1;               // 117
    bool IS_LOAD_GL_EXT_framebuffer_object : 1;                    // 118
    bool IS_LOAD_GL_EXT_geometry_shader4 : 1;                      // 119
    bool IS_LOAD_GL_EXT_gpu_program_parameters : 1;                // 120
    bool IS_LOAD_GL_EXT_gpu_shader4 : 1;                           // 121
    bool IS_LOAD_GL_EXT_histogram : 1;                             // 122
    bool IS_LOAD_GL_EXT_index_func : 1;                            // 123
    bool IS_LOAD_GL_EXT_index_material : 1;                        // 124
    bool IS_LOAD_GL_EXT_light_texture : 1;                         // 125
    bool IS_LOAD_GL_EXT_memory_object : 1;                         // 126
    bool IS_LOAD_GL_EXT_memory_object_fd : 1;                      // 127
    bool IS_LOAD_GL_EXT_memory_object_win32 : 1;                   // 128
    bool IS_LOAD_GL_EXT_multi_draw_arrays : 1;                     // 129
    bool IS_LOAD_GL_EXT_multisample : 1;                           // 130
    bool IS_LOAD_GL_EXT_paletted_texture : 1;                      // 131
    bool IS_LOAD_GL_EXT_pixel_transform : 1;                       // 132
    bool IS_LOAD_GL_EXT_point_parameters : 1;                      // 133
    bool IS_LOAD_GL_EXT_polygon_offset : 1;                        // 134
    bool IS_LOAD_GL_EXT_polygon_offset_clamp : 1;                  // 135
    bool IS_LOAD_GL_EXT_provoking_vertex : 1;                      // 136
    bool IS_LOAD_GL_EXT_raster_multisample : 1;                    // 137
    bool IS_LOAD_GL_EXT_secondary_color : 1;                       // 138
    bool IS_LOAD_GL_EXT_semaphore : 1;                             // 139
    bool IS_LOAD_GL_EXT_semaphore_fd : 1;                          // 140
    bool IS_LOAD_GL_EXT_semaphore_win32 : 1;                       // 141
    bool IS_LOAD_GL_EXT_separate_shader_objects : 1;               // 142
    bool IS_LOAD_GL_EXT_shader_framebuffer_fetch_non_coherent : 1; // 143
    bool IS_LOAD_GL_EXT_shader_image_load_store : 1;               // 144
    bool IS_LOAD_GL_EXT_stencil_clear_tag : 1;                     // 145
    bool IS_LOAD_GL_EXT_stencil_two_side : 1;                      // 146
    bool IS_LOAD_GL_EXT_subtexture : 1;                            // 147
    bool IS_LOAD_GL_EXT_texture3D : 1;                             // 148
    bool IS_LOAD_GL_EXT_texture_array : 1;                         // 149
    bool IS_LOAD_GL_EXT_texture_buffer_object : 1;                 // 150
    bool IS_LOAD_GL_EXT_texture_integer : 1;                       // 151
    bool IS_LOAD_GL_EXT_texture_object : 1;                        // 152
    bool IS_LOAD_GL_EXT_texture_perturb_normal : 1;                // 153
    bool IS_LOAD_GL_EXT_texture_storage : 1;                       // 154
    bool IS_LOAD_GL_EXT_timer_query : 1;                           // 155
    bool IS_LOAD_GL_EXT_transform_feedback : 1;                    // 156
    bool IS_LOAD_GL_EXT_vertex_array : 1;                          // 157
    bool IS_LOAD_GL_EXT_vertex_attrib_64bit : 1;                   // 158
    bool IS_LOAD_GL_EXT_vertex_shader : 1;                         // 159
    bool IS_LOAD_GL_EXT_vertex_weighting : 1;                      // 160
    bool IS_LOAD_GL_EXT_win32_keyed_mutex : 1;                     // 161
    bool IS_LOAD_GL_EXT_window_rectangles : 1;                     // 162
    bool IS_LOAD_GL_EXT_x11_sync_object : 1;                       // 163
    bool IS_LOAD_GL_GREMEDY_frame_terminator : 1;                  // 164
    bool IS_LOAD_GL_GREMEDY_string_marker : 1;                     // 165
    bool IS_LOAD_GL_HP_image_transform : 1;                        // 166
    bool IS_LOAD_GL_IBM_multimode_draw_arrays : 1;                 // 167
    bool IS_LOAD_GL_IBM_static_data : 1;                           // 168
    bool IS_LOAD_GL_IBM_vertex_array_lists : 1;                    // 169
    bool IS_LOAD_GL_INGR_blend_func_separate : 1;                  // 170
    bool IS_LOAD_GL_INTEL_framebuffer_CMAA : 1;                    // 171
    bool IS_LOAD_GL_INTEL_map_texture : 1;                         // 172
    bool IS_LOAD_GL_INTEL_parallel_arrays : 1;                     // 173
    bool IS_LOAD_GL_INTEL_performance_query : 1;                   // 174
    bool IS_LOAD_GL_MESA_framebuffer_flip_y : 1;                   // 175
    bool IS_LOAD_GL_MESA_resize_buffers : 1;                       // 176
    bool IS_LOAD_GL_MESA_window_pos : 1;                           // 177
    bool IS_LOAD_GL_NVX_conditional_render : 1;                    // 178
    bool IS_LOAD_GL_NVX_gpu_multicast2 : 1;                        // 179
    bool IS_LOAD_GL_NVX_linked_gpu_multicast : 1;                  // 180
    bool IS_LOAD_GL_NVX_progress_fence : 1;                        // 181
    bool IS_LOAD_GL_NV_alpha_to_coverage_dither_control : 1;       // 182
    bool IS_LOAD_GL_NV_bindless_multi_draw_indirect : 1;           // 183
    bool IS_LOAD_GL_NV_bindless_multi_draw_indirect_count : 1;     // 184
    bool IS_LOAD_GL_NV_bindless_texture : 1;                       // 185
    bool IS_LOAD_GL_NV_blend_equation_advanced : 1;                // 186
    bool IS_LOAD_GL_NV_clip_space_w_scaling : 1;                   // 187
    bool IS_LOAD_GL_NV_command_list : 1;                           // 188
    bool IS_LOAD_GL_NV_conditional_render : 1;                     // 189
    bool IS_LOAD_GL_NV_conservative_raster : 1;                    // 190
    bool IS_LOAD_GL_NV_conservative_raster_dilate : 1;             // 191
    bool IS_LOAD_GL_NV_conservative_raster_pre_snap_triangles : 1; // 192
    bool IS_LOAD_GL_NV_copy_image : 1;                             // 193
    bool IS_LOAD_GL_NV_depth_buffer_float : 1;                     // 194
    bool IS_LOAD_GL_NV_draw_texture : 1;                           // 195
    bool IS_LOAD_GL_NV_draw_vulkan_image : 1;                      // 196
    bool IS_LOAD_GL_NV_evaluators : 1;                             // 197
    bool IS_LOAD_GL_NV_explicit_multisample : 1;                   // 198
    bool IS_LOAD_GL_NV_fence : 1;                                  // 199
    bool IS_LOAD_GL_NV_fragment_coverage_to_color : 1;             // 200
    bool IS_LOAD_GL_NV_fragment_program : 1;                       // 201
    bool IS_LOAD_GL_NV_framebuffer_mixed_samples : 1;              // 202
    bool IS_LOAD_GL_NV_framebuffer_multisample_coverage : 1;       // 203
    bool IS_LOAD_GL_NV_geometry_program4 : 1;                      // 204
    bool IS_LOAD_GL_NV_gpu_multicast : 1;                          // 205
    bool IS_LOAD_GL_NV_gpu_program4 : 1;                           // 206
    bool IS_LOAD_GL_NV_gpu_program5 : 1;                           // 207
    bool IS_LOAD_GL_NV_half_float : 1;                             // 208
    bool IS_LOAD_GL_NV_internalformat_sample_query : 1;            // 209
    bool IS_LOAD_GL_NV_memory_attachment : 1;                      // 210
    bool IS_LOAD_GL_NV_memory_object_sparse : 1;                   // 211
    bool IS_LOAD_GL_NV_mesh_shader : 1;                            // 212
    bool IS_LOAD_GL_NV_occlusion_query : 1;                        // 213
    bool IS_LOAD_GL_NV_parameter_buffer_object : 1;                // 214
    bool IS_LOAD_GL_NV_path_rendering : 1;                         // 215
    bool IS_LOAD_GL_NV_pixel_data_range : 1;                       // 216
    bool IS_LOAD_GL_NV_point_sprite : 1;                           // 217
    bool IS_LOAD_GL_NV_present_video : 1;                          // 218
    bool IS_LOAD_GL_NV_primitive_restart : 1;                      // 219
    bool IS_LOAD_GL_NV_query_resource : 1;                         // 220
    bool IS_LOAD_GL_NV_query_resource_tag : 1;                     // 221
    bool IS_LOAD_GL_NV_register_combiners : 1;                     // 222
    bool IS_LOAD_GL_NV_register_combiners2 : 1;                    // 223
    bool IS_LOAD_GL_NV_sample_locations : 1;                       // 224
    bool IS_LOAD_GL_NV_scissor_exclusive : 1;                      // 225
    bool IS_LOAD_GL_NV_shader_buffer_load : 1;                     // 226
    bool IS_LOAD_GL_NV_shading_rate_image : 1;                     // 227
    bool IS_LOAD_GL_NV_texture_barrier : 1;                        // 228
    bool IS_LOAD_GL_NV_texture_multisample : 1;                    // 229
    bool IS_LOAD_GL_NV_timeline_semaphore : 1;                     // 230
    bool IS_LOAD_GL_NV_transform_feedback : 1;                     // 231
    bool IS_LOAD_GL_NV_transform_feedback2 : 1;                    // 232
    bool IS_LOAD_GL_NV_vdpau_interop : 1;                          // 233
    bool IS_LOAD_GL_NV_vdpau_interop2 : 1;                         // 234
    bool IS_LOAD_GL_NV_vertex_array_range : 1;                     // 235
    bool IS_LOAD_GL_NV_vertex_attrib_integer_64bit : 1;            // 236
    bool IS_LOAD_GL_NV_vertex_buffer_unified_memory : 1;           // 237
    bool IS_LOAD_GL_NV_vertex_program : 1;                         // 238
    bool IS_LOAD_GL_NV_video_capture : 1;                          // 239
    bool IS_LOAD_GL_NV_viewport_swizzle : 1;                       // 240
    bool IS_LOAD_GL_OVR_multiview : 1;                             // 241
    bool IS_LOAD_GL_PGI_misc_hints : 1;                            // 242
    bool IS_LOAD_GL_SGIS_detail_texture : 1;                       // 243
    bool IS_LOAD_GL_SGIS_fog_function : 1;                         // 244
    bool IS_LOAD_GL_SGIS_multisample : 1;                          // 245
    bool IS_LOAD_GL_SGIS_pixel_texture : 1;                        // 246
    bool IS_LOAD_GL_SGIS_point_parameters : 1;                     // 247
    bool IS_LOAD_GL_SGIS_sharpen_texture : 1;                      // 248
    bool IS_LOAD_GL_SGIS_texture4D : 1;                            // 249
    bool IS_LOAD_GL_SGIS_texture_color_mask : 1;                   // 250
    bool IS_LOAD_GL_SGIS_texture_filter4 : 1;                      // 251
    bool IS_LOAD_GL_SGIX_async : 1;                                // 252
    bool IS_LOAD_GL_SGIX_flush_raster : 1;                         // 253
    bool IS_LOAD_GL_SGIX_fragment_lighting : 1;                    // 254
    bool IS_LOAD_GL_SGIX_framezoom : 1;                            // 255
    bool IS_LOAD_GL_SGIX_igloo_interface : 1;                      // 256
    bool IS_LOAD_GL_SGIX_instruments : 1;                          // 257
    bool IS_LOAD_GL_SGIX_list_priority : 1;                        // 258
    bool IS_LOAD_GL_SGIX_pixel_texture : 1;                        // 259
    bool IS_LOAD_GL_SGIX_polynomial_ffd : 1;                       // 260
    bool IS_LOAD_GL_SGIX_reference_plane : 1;                      // 261
    bool IS_LOAD_GL_SGIX_sprite : 1;                               // 262
    bool IS_LOAD_GL_SGIX_tag_sample_buffer : 1;                    // 263
    bool IS_LOAD_GL_SGI_color_table : 1;                           // 264
    bool IS_LOAD_GL_SUNX_constant_data : 1;                        // 265
    bool IS_LOAD_GL_SUN_global_alpha : 1;                          // 266
    bool IS_LOAD_GL_SUN_mesh_array : 1;                            // 267
    bool IS_LOAD_GL_SUN_triangle_list : 1;                         // 268
    bool IS_LOAD_GL_SUN_vertex : 1;                                // 269
    bool IS_LOAD_GL_VERSION_1_0 : 1;                               // 270
    bool IS_LOAD_GL_VERSION_1_1 : 1;                               // 271
    bool IS_LOAD_GL_NV_gpu_shader5 : 1;                            // 272
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  OpenGLLoaderLoader();
  // GLAPI void APIENTRY glDrawRangeElements (GLenum mode, GLuint start, GLuint
  // end, GLsizei count, GLenum type, const void *indices);
  VKFUNDEFINE(glDrawRangeElements);
  // GLAPI void APIENTRY glTexImage3D (GLenum target, GLint level, GLint
  // internalformat, GLsizei width, GLsizei height, GLsizei depth, GLint border,
  // GLenum format, GLenum type, const void *pixels);
  VKFUNDEFINE(glTexImage3D);
  // GLAPI void APIENTRY glTexSubImage3D (GLenum target, GLint level, GLint
  // xoffset, GLint yoffset, GLint zoffset, GLsizei width, GLsizei height,
  // GLsizei depth, GLenum format, GLenum type, const void *pixels);
