#pragma once
#include "../PhiLoader.hpp"
#include <GL/wgl.h>
#include <GL/wglext.h>
typedef PFNWGLCREATEBUFFERREGIONARBPROC PFN_wglCreateBufferRegionARB;
typedef PFNWGLDELETEBUFFERREGIONARBPROC PFN_wglDeleteBufferRegionARB;
typedef PFNWGLSAVEBUFFERREGIONARBPROC PFN_wglSaveBufferRegionARB;
typedef PFNWGLRESTOREBUFFERREGIONARBPROC PFN_wglRestoreBufferRegionARB;
typedef PFNWGLCREATECONTEXTATTRIBSARBPROC PFN_wglCreateContextAttribsARB;
typedef PFNWGLGETEXTENSIONSSTRINGARBPROC PFN_wglGetExtensionsStringARB;
typedef PFNWGLMAKECONTEXTCURRENTARBPROC PFN_wglMakeContextCurrentARB;
typedef PFNWGLGETCURRENTREADDCARBPROC PFN_wglGetCurrentReadDCARB;
typedef PFNWGLCREATEPBUFFERARBPROC PFN_wglCreatePbufferARB;
typedef PFNWGLGETPBUFFERDCARBPROC PFN_wglGetPbufferDCARB;
typedef PFNWGLRELEASEPBUFFERDCARBPROC PFN_wglReleasePbufferDCARB;
typedef PFNWGLDESTROYPBUFFERARBPROC PFN_wglDestroyPbufferARB;
typedef PFNWGLQUERYPBUFFERARBPROC PFN_wglQueryPbufferARB;
typedef PFNWGLGETPIXELFORMATATTRIBIVARBPROC PFN_wglGetPixelFormatAttribivARB;
typedef PFNWGLGETPIXELFORMATATTRIBFVARBPROC PFN_wglGetPixelFormatAttribfvARB;
typedef PFNWGLCHOOSEPIXELFORMATARBPROC PFN_wglChoosePixelFormatARB;
typedef PFNWGLBINDTEXIMAGEARBPROC PFN_wglBindTexImageARB;
typedef PFNWGLRELEASETEXIMAGEARBPROC PFN_wglReleaseTexImageARB;
typedef PFNWGLSETPBUFFERATTRIBARBPROC PFN_wglSetPbufferAttribARB;
typedef PFNWGLSETSTEREOEMITTERSTATE3DLPROC PFN_wglSetStereoEmitterState3DL;
typedef PFNWGLGETGPUIDSAMDPROC PFN_wglGetGPUIDsAMD;

typedef PFNWGLQUERYSWAPGROUPNVPROC PFN_wglQuerySwapGroupNV;
typedef PFNWGLQUERYMAXSWAPGROUPSNVPROC PFN_wglQueryMaxSwapGroupsNV;
typedef PFNWGLQUERYFRAMECOUNTNVPROC PFN_wglQueryFrameCountNV;
typedef PFNWGLRESETFRAMECOUNTNVPROC PFN_wglResetFrameCountNV;
typedef PFNWGLALLOCATEMEMORYNVPROC PFN_wglAllocateMemoryNV;
typedef PFNWGLFREEMEMORYNVPROC PFN_wglFreeMemoryNV;
typedef PFNWGLBINDVIDEOCAPTUREDEVICENVPROC PFN_wglBindVideoCaptureDeviceNV;
typedef PFNWGLENUMERATEVIDEOCAPTUREDEVICESNVPROC
    PFN_wglEnumerateVideoCaptureDevicesNV;
typedef PFNWGLLOCKVIDEOCAPTUREDEVICENVPROC PFN_wglLockVideoCaptureDeviceNV;
typedef PFNWGLQUERYVIDEOCAPTUREDEVICENVPROC PFN_wglQueryVideoCaptureDeviceNV;
typedef PFNWGLRELEASEVIDEOCAPTUREDEVICENVPROC
    PFN_wglReleaseVideoCaptureDeviceNV;
typedef PFNWGLGETVIDEODEVICENVPROC PFN_wglGetVideoDeviceNV;
typedef PFNWGLRELEASEVIDEODEVICENVPROC PFN_wglReleaseVideoDeviceNV;
typedef PFNWGLBINDVIDEOIMAGENVPROC PFN_wglBindVideoImageNV;
typedef PFNWGLRELEASEVIDEOIMAGENVPROC PFN_wglReleaseVideoImageNV;
typedef PFNWGLSENDPBUFFERTOVIDEONVPROC PFN_wglSendPbufferToVideoNV;
typedef PFNWGLGETVIDEOINFONVPROC PFN_wglGetVideoInfoNV;
typedef PFNWGLGETSYNCVALUESOMLPROC PFN_wglGetSyncValuesOML;
typedef PFNWGLGETMSCRATEOMLPROC PFN_wglGetMscRateOML;
typedef PFNWGLSWAPBUFFERSMSCOMLPROC PFN_wglSwapBuffersMscOML;
typedef PFNWGLSWAPLAYERBUFFERSMSCOMLPROC PFN_wglSwapLayerBuffersMscOML;
typedef PFNWGLWAITFORMSCOMLPROC PFN_wglWaitForMscOML;
typedef PFNWGLWAITFORSBCOMLPROC PFN_wglWaitForSbcOML;
typedef PFNCHOOSEPIXELFORMATPROC PFN_ChoosePixelFormat;
typedef PFNDESCRIBEPIXELFORMATPROC PFN_DescribePixelFormat;
typedef PFNGETENHMETAFILEPIXELFORMATPROC PFN_GetEnhMetaFilePixelFormat;
typedef PFNGETPIXELFORMATPROC PFN_GetPixelFormat;
typedef PFNSETPIXELFORMATPROC PFN_SetPixelFormat;
typedef PFNSWAPBUFFERSPROC PFN_SwapBuffers;
typedef PFNWGLCOPYCONTEXTPROC PFN_wglCopyContext;
typedef PFNWGLCREATECONTEXTPROC PFN_wglCreateContext;
typedef PFNWGLCREATELAYERCONTEXTPROC PFN_wglCreateLayerContext;
typedef PFNWGLDELETECONTEXTPROC PFN_wglDeleteContext;
typedef PFNWGLDESCRIBELAYERPLANEPROC PFN_wglDescribeLayerPlane;
typedef PFNWGLGETCURRENTCONTEXTPROC PFN_wglGetCurrentContext;
typedef PFNWGLGETCURRENTDCPROC PFN_wglGetCurrentDC;
typedef PFNWGLGETLAYERPALETTEENTRIESPROC PFN_wglGetLayerPaletteEntries;
typedef PFNWGLGETPROCADDRESSPROC PFN_wglGetProcAddress;
typedef PFNWGLMAKECURRENTPROC PFN_wglMakeCurrent;
typedef PFNWGLREALIZELAYERPALETTEPROC PFN_wglRealizeLayerPalette;
typedef PFNWGLSETLAYERPALETTEENTRIESPROC PFN_wglSetLayerPaletteEntries;
typedef PFNWGLSHARELISTSPROC PFN_wglShareLists;
typedef PFNWGLSWAPLAYERBUFFERSPROC PFN_wglSwapLayerBuffers;
typedef PFNWGLUSEFONTBITMAPSPROC PFN_wglUseFontBitmaps;
typedef PFNWGLUSEFONTBITMAPSAPROC PFN_wglUseFontBitmapsA;
typedef PFNWGLUSEFONTBITMAPSWPROC PFN_wglUseFontBitmapsW;
typedef PFNWGLUSEFONTOUTLINESPROC PFN_wglUseFontOutlines;
typedef PFNWGLUSEFONTOUTLINESAPROC PFN_wglUseFontOutlinesA;
typedef PFNWGLUSEFONTOUTLINESWPROC PFN_wglUseFontOutlinesW;
#define VKFUNDEFINE(NAME) PFN_##NAME NAME##;

class WGLLoaderLoader {
public:
  typedef APIProc (*UserptrLoadFunc)(void *userptr, std::string_view name);
  struct Flags : public LONGBITSET {
    Flags() : LONGBITSET(sizeof(Flags), 32) {}
    bool IS_LOAD_WGL_ARB_buffer_region : 1;         // 0
    bool IS_LOAD_WGL_ARB_create_context : 1;        // 1
    bool IS_LOAD_WGL_ARB_extensions_string : 1;     // 2
    bool IS_LOAD_WGL_ARB_make_current_read : 1;     // 3
    bool IS_LOAD_WGL_ARB_pbuffer : 1;               // 4
    bool IS_LOAD_WGL_ARB_pixel_format : 1;          // 5
    bool IS_LOAD_WGL_ARB_render_texture : 1;        // 6
    bool IS_LOAD_WGL_3DL_stereo_control : 1;        // 7
    bool IS_LOAD_WGL_AMD_gpu_association : 1;       // 8
    bool IS_LOAD_WGL_EXT_display_color_table : 1;   // 9
    bool IS_LOAD_WGL_EXT_extensions_string : 1;     // 10
    bool IS_LOAD_WGL_EXT_make_current_read : 1;     // 11
    bool IS_LOAD_WGL_EXT_pbuffer : 1;               // 12
    bool IS_LOAD_WGL_EXT_pixel_format : 1;          // 13
    bool IS_LOAD_WGL_EXT_swap_control : 1;          // 14
    bool IS_LOAD_WGL_I3D_digital_video_control : 1; // 15
    bool IS_LOAD_WGL_I3D_gamma : 1;                 // 16
    bool IS_LOAD_WGL_I3D_genlock : 1;               // 17
    bool IS_LOAD_WGL_I3D_image_buffer : 1;          // 18
    bool IS_LOAD_WGL_I3D_swap_frame_lock : 1;       // 19
    bool IS_LOAD_WGL_I3D_swap_frame_usage : 1;      // 20
    bool IS_LOAD_WGL_NV_DX_interop : 1;             // 21
    bool IS_LOAD_WGL_NV_copy_image : 1;             // 22
    bool IS_LOAD_WGL_NV_delay_before_swap : 1;      // 23
    bool IS_LOAD_WGL_NV_gpu_affinity : 1;           // 24
    bool IS_LOAD_WGL_NV_present_video : 1;          // 25
    bool IS_LOAD_WGL_NV_swap_group : 1;             // 26
    bool IS_LOAD_WGL_NV_vertex_array_range : 1;     // 27
    bool IS_LOAD_WGL_NV_video_capture : 1;          // 28
    bool IS_LOAD_WGL_NV_video_output : 1;           // 29
    bool IS_LOAD_WGL_OML_sync_control : 1;          // 30
    bool IS_LOAD_WGL_VERSION_1_0 : 1;               // 31
  };

private:
  Flags NowState;

public:
  Flags NeedLoad;
  UserptrLoadFunc LoadFunc;
  void *userptr;
  inline APIProc TryToGet(std::string_view name) {
    return LoadFunc(userptr, name);
  }
  inline const Flags &GetNowState() const { return NowState; }
  WGLLoaderLoader();
  // HANDLE WINAPI wglCreateBufferRegionARB (HDC hDC, int iLayerPlane, UINT
  // uType);
  VKFUNDEFINE(wglCreateBufferRegionARB);
  // VOID WINAPI wglDeleteBufferRegionARB (HANDLE hRegion);
  VKFUNDEFINE(wglDeleteBufferRegionARB);
  // BOOL WINAPI wglSaveBufferRegionARB (HANDLE hRegion, int x, int y, int
  // width, int height);
  VKFUNDEFINE(wglSaveBufferRegionARB);
  // BOOL WINAPI wglRestoreBufferRegionARB (HANDLE hRegion, int x, int y, int
  // width, int height, int xSrc, int ySrc);
  VKFUNDEFINE(wglRestoreBufferRegionARB);
  // HGLRC WINAPI wglCreateContextAttribsARB (HDC hDC, HGLRC hShareContext,
  // const int *attribList);
